GopalSaraf/Practicals/PSDL/include/proc/pic16lf1619.inc
// Register: PID1K3H
#define PID1K3H PID1K3H
PID1K3H                                  equ 0595h
// bitfield definitions
PID1K3H_PID1K38_POSN                     equ 0000h
PID1K3H_PID1K38_POSITION                 equ 0000h
PID1K3H_PID1K38_SIZE                     equ 0001h
PID1K3H_PID1K38_LENGTH                   equ 0001h
PID1K3H_PID1K38_MASK                     equ 0001h
PID1K3H_PID1K39_POSN                     equ 0001h
PID1K3H_PID1K39_POSITION                 equ 0001h
PID1K3H_PID1K39_SIZE                     equ 0001h
PID1K3H_PID1K39_LENGTH                   equ 0001h
PID1K3H_PID1K39_MASK                     equ 0002h
PID1K3H_PID1K310_POSN                    equ 0002h
PID1K3H_PID1K310_POSITION                equ 0002h
PID1K3H_PID1K310_SIZE                    equ 0001h
PID1K3H_PID1K310_LENGTH                  equ 0001h
PID1K3H_PID1K310_MASK                    equ 0004h
PID1K3H_PID1K311_POSN                    equ 0003h
PID1K3H_PID1K311_POSITION                equ 0003h
PID1K3H_PID1K311_SIZE                    equ 0001h
PID1K3H_PID1K311_LENGTH                  equ 0001h
PID1K3H_PID1K311_MASK                    equ 0008h
PID1K3H_PID1K312_POSN                    equ 0004h
PID1K3H_PID1K312_POSITION                equ 0004h
PID1K3H_PID1K312_SIZE                    equ 0001h
PID1K3H_PID1K312_LENGTH                  equ 0001h
PID1K3H_PID1K312_MASK                    equ 0010h
PID1K3H_PID1K313_POSN                    equ 0005h
PID1K3H_PID1K313_POSITION                equ 0005h
PID1K3H_PID1K313_SIZE                    equ 0001h
PID1K3H_PID1K313_LENGTH                  equ 0001h
PID1K3H_PID1K313_MASK                    equ 0020h
PID1K3H_PID1K314_POSN                    equ 0006h
PID1K3H_PID1K314_POSITION                equ 0006h
PID1K3H_PID1K314_SIZE                    equ 0001h
PID1K3H_PID1K314_LENGTH                  equ 0001h
PID1K3H_PID1K314_MASK                    equ 0040h
PID1K3H_PID1K315_POSN                    equ 0007h
PID1K3H_PID1K315_POSITION                equ 0007h
PID1K3H_PID1K315_SIZE                    equ 0001h
PID1K3H_PID1K315_LENGTH                  equ 0001h
PID1K3H_PID1K315_MASK                    equ 0080h
PID1K3H_K38_POSN                         equ 0000h
PID1K3H_K38_POSITION                     equ 0000h
PID1K3H_K38_SIZE                         equ 0001h
PID1K3H_K38_LENGTH                       equ 0001h
PID1K3H_K38_MASK                         equ 0001h
PID1K3H_K39_POSN                         equ 0001h
PID1K3H_K39_POSITION                     equ 0001h
PID1K3H_K39_SIZE                         equ 0001h
PID1K3H_K39_LENGTH                       equ 0001h
PID1K3H_K39_MASK                         equ 0002h
PID1K3H_K310_POSN                        equ 0002h
PID1K3H_K310_POSITION                    equ 0002h
PID1K3H_K310_SIZE                        equ 0001h
PID1K3H_K310_LENGTH                      equ 0001h
PID1K3H_K310_MASK                        equ 0004h
PID1K3H_K311_POSN                        equ 0003h
PID1K3H_K311_POSITION                    equ 0003h
PID1K3H_K311_SIZE                        equ 0001h
PID1K3H_K311_LENGTH                      equ 0001h
PID1K3H_K311_MASK                        equ 0008h
PID1K3H_K312_POSN                        equ 0004h
PID1K3H_K312_POSITION                    equ 0004h
PID1K3H_K312_SIZE                        equ 0001h
PID1K3H_K312_LENGTH                      equ 0001h
PID1K3H_K312_MASK                        equ 0010h
PID1K3H_K313_POSN                        equ 0005h
PID1K3H_K313_POSITION                    equ 0005h
PID1K3H_K313_SIZE                        equ 0001h
PID1K3H_K313_LENGTH                      equ 0001h
PID1K3H_K313_MASK                        equ 0020h
PID1K3H_K314_POSN                        equ 0006h
PID1K3H_K314_POSITION                    equ 0006h
PID1K3H_K314_SIZE                        equ 0001h
PID1K3H_K314_LENGTH                      equ 0001h
PID1K3H_K314_MASK                        equ 0040h
PID1K3H_K315_POSN                        equ 0007h
PID1K3H_K315_POSITION                    equ 0007h
PID1K3H_K315_SIZE                        equ 0001h
PID1K3H_K315_LENGTH                      equ 0001h
PID1K3H_K315_MASK                        equ 0080h

// Register: PID1OUTLL
#define PID1OUTLL PID1OUTLL
PID1OUTLL                                equ 0596h
// bitfield definitions
PID1OUTLL_PID1OUT0_POSN                  equ 0000h
PID1OUTLL_PID1OUT0_POSITION              equ 0000h
PID1OUTLL_PID1OUT0_SIZE                  equ 0001h
PID1OUTLL_PID1OUT0_LENGTH                equ 0001h
PID1OUTLL_PID1OUT0_MASK                  equ 0001h
PID1OUTLL_PID1OUT1_POSN                  equ 0001h
PID1OUTLL_PID1OUT1_POSITION              equ 0001h
PID1OUTLL_PID1OUT1_SIZE                  equ 0001h
PID1OUTLL_PID1OUT1_LENGTH                equ 0001h
PID1OUTLL_PID1OUT1_MASK                  equ 0002h
PID1OUTLL_PID1OUT2_POSN                  equ 0002h
PID1OUTLL_PID1OUT2_POSITION              equ 0002h
PID1OUTLL_PID1OUT2_SIZE                  equ 0001h
PID1OUTLL_PID1OUT2_LENGTH                equ 0001h
PID1OUTLL_PID1OUT2_MASK                  equ 0004h
PID1OUTLL_PID1OUT3_POSN                  equ 0003h
PID1OUTLL_PID1OUT3_POSITION              equ 0003h
PID1OUTLL_PID1OUT3_SIZE                  equ 0001h
PID1OUTLL_PID1OUT3_LENGTH                equ 0001h
PID1OUTLL_PID1OUT3_MASK                  equ 0008h
PID1OUTLL_PID1OUT4_POSN                  equ 0004h
PID1OUTLL_PID1OUT4_POSITION              equ 0004h
PID1OUTLL_PID1OUT4_SIZE                  equ 0001h
PID1OUTLL_PID1OUT4_LENGTH                equ 0001h
PID1OUTLL_PID1OUT4_MASK                  equ 0010h
PID1OUTLL_PID1OUT5_POSN                  equ 0005h
PID1OUTLL_PID1OUT5_POSITION              equ 0005h
PID1OUTLL_PID1OUT5_SIZE                  equ 0001h
PID1OUTLL_PID1OUT5_LENGTH                equ 0001h
PID1OUTLL_PID1OUT5_MASK                  equ 0020h
PID1OUTLL_PID1OUT6_POSN                  equ 0006h
PID1OUTLL_PID1OUT6_POSITION              equ 0006h
PID1OUTLL_PID1OUT6_SIZE                  equ 0001h
PID1OUTLL_PID1OUT6_LENGTH                equ 0001h
PID1OUTLL_PID1OUT6_MASK                  equ 0040h
PID1OUTLL_PID1OUT7_POSN                  equ 0007h
PID1OUTLL_PID1OUT7_POSITION              equ 0007h
PID1OUTLL_PID1OUT7_SIZE                  equ 0001h
PID1OUTLL_PID1OUT7_LENGTH                equ 0001h
PID1OUTLL_PID1OUT7_MASK                  equ 0080h
PID1OUTLL_OUT0_POSN                      equ 0000h
PID1OUTLL_OUT0_POSITION                  equ 0000h
PID1OUTLL_OUT0_SIZE                      equ 0001h
PID1OUTLL_OUT0_LENGTH                    equ 0001h
PID1OUTLL_OUT0_MASK                      equ 0001h
PID1OUTLL_OUT1_POSN                      equ 0001h
PID1OUTLL_OUT1_POSITION                  equ 0001h
PID1OUTLL_OUT1_SIZE                      equ 0001h
PID1OUTLL_OUT1_LENGTH                    equ 0001h
PID1OUTLL_OUT1_MASK                      equ 0002h
PID1OUTLL_OUT2_POSN                      equ 0002h
PID1OUTLL_OUT2_POSITION                  equ 0002h
PID1OUTLL_OUT2_SIZE                      equ 0001h
PID1OUTLL_OUT2_LENGTH                    equ 0001h
PID1OUTLL_OUT2_MASK                      equ 0004h
PID1OUTLL_OUT3_POSN                      equ 0003h
PID1OUTLL_OUT3_POSITION                  equ 0003h
PID1OUTLL_OUT3_SIZE                      equ 0001h
PID1OUTLL_OUT3_LENGTH                    equ 0001h
PID1OUTLL_OUT3_MASK                      equ 0008h
PID1OUTLL_OUT4_POSN                      equ 0004h
PID1OUTLL_OUT4_POSITION                  equ 0004h
PID1OUTLL_OUT4_SIZE                      equ 0001h
PID1OUTLL_OUT4_LENGTH                    equ 0001h
PID1OUTLL_OUT4_MASK                      equ 0010h
PID1OUTLL_OUT5_POSN                      equ 0005h
PID1OUTLL_OUT5_POSITION                  equ 0005h
PID1OUTLL_OUT5_SIZE                      equ 0001h
PID1OUTLL_OUT5_LENGTH                    equ 0001h
PID1OUTLL_OUT5_MASK                      equ 0020h
PID1OUTLL_OUT6_POSN                      equ 0006h
PID1OUTLL_OUT6_POSITION                  equ 0006h
PID1OUTLL_OUT6_SIZE                      equ 0001h
PID1OUTLL_OUT6_LENGTH                    equ 0001h
PID1OUTLL_OUT6_MASK                      equ 0040h
PID1OUTLL_OUT7_POSN                      equ 0007h
PID1OUTLL_OUT7_POSITION                  equ 0007h
PID1OUTLL_OUT7_SIZE                      equ 0001h
PID1OUTLL_OUT7_LENGTH                    equ 0001h
PID1OUTLL_OUT7_MASK                      equ 0080h

// Register: PID1OUTLH
#define PID1OUTLH PID1OUTLH
PID1OUTLH                                equ 0597h
// bitfield definitions
PID1OUTLH_PID1OUT8_POSN                  equ 0000h
PID1OUTLH_PID1OUT8_POSITION              equ 0000h
PID1OUTLH_PID1OUT8_SIZE                  equ 0001h
PID1OUTLH_PID1OUT8_LENGTH                equ 0001h
PID1OUTLH_PID1OUT8_MASK                  equ 0001h
PID1OUTLH_PID1OUT9_POSN                  equ 0001h
PID1OUTLH_PID1OUT9_POSITION              equ 0001h
PID1OUTLH_PID1OUT9_SIZE                  equ 0001h
PID1OUTLH_PID1OUT9_LENGTH                equ 0001h
PID1OUTLH_PID1OUT9_MASK                  equ 0002h
PID1OUTLH_PID1OUT10_POSN                 equ 0002h
PID1OUTLH_PID1OUT10_POSITION             equ 0002h
PID1OUTLH_PID1OUT10_SIZE                 equ 0001h
PID1OUTLH_PID1OUT10_LENGTH               equ 0001h
PID1OUTLH_PID1OUT10_MASK                 equ 0004h
PID1OUTLH_PID1OUT11_POSN                 equ 0003h
PID1OUTLH_PID1OUT11_POSITION             equ 0003h
PID1OUTLH_PID1OUT11_SIZE                 equ 0001h
PID1OUTLH_PID1OUT11_LENGTH               equ 0001h
PID1OUTLH_PID1OUT11_MASK                 equ 0008h
PID1OUTLH_PID1OUT12_POSN                 equ 0004h
PID1OUTLH_PID1OUT12_POSITION             equ 0004h
PID1OUTLH_PID1OUT12_SIZE                 equ 0001h
PID1OUTLH_PID1OUT12_LENGTH               equ 0001h
PID1OUTLH_PID1OUT12_MASK                 equ 0010h
PID1OUTLH_PID1OUT13_POSN                 equ 0005h
PID1OUTLH_PID1OUT13_POSITION             equ 0005h
PID1OUTLH_PID1OUT13_SIZE                 equ 0001h
PID1OUTLH_PID1OUT13_LENGTH               equ 0001h
PID1OUTLH_PID1OUT13_MASK                 equ 0020h
PID1OUTLH_PID1OUT14_POSN                 equ 0006h
PID1OUTLH_PID1OUT14_POSITION             equ 0006h
PID1OUTLH_PID1OUT14_SIZE                 equ 0001h
PID1OUTLH_PID1OUT14_LENGTH               equ 0001h
PID1OUTLH_PID1OUT14_MASK                 equ 0040h
PID1OUTLH_PID1OUT15_POSN                 equ 0007h
PID1OUTLH_PID1OUT15_POSITION             equ 0007h
PID1OUTLH_PID1OUT15_SIZE                 equ 0001h
PID1OUTLH_PID1OUT15_LENGTH               equ 0001h
PID1OUTLH_PID1OUT15_MASK                 equ 0080h
PID1OUTLH_OUT8_POSN                      equ 0000h
PID1OUTLH_OUT8_POSITION                  equ 0000h
PID1OUTLH_OUT8_SIZE                      equ 0001h
PID1OUTLH_OUT8_LENGTH                    equ 0001h
PID1OUTLH_OUT8_MASK                      equ 0001h
PID1OUTLH_OUT9_POSN                      equ 0001h
PID1OUTLH_OUT9_POSITION                  equ 0001h
PID1OUTLH_OUT9_SIZE                      equ 0001h
PID1OUTLH_OUT9_LENGTH                    equ 0001h
PID1OUTLH_OUT9_MASK                      equ 0002h
PID1OUTLH_OUT10_POSN                     equ 0002h
PID1OUTLH_OUT10_POSITION                 equ 0002h
PID1OUTLH_OUT10_SIZE                     equ 0001h
PID1OUTLH_OUT10_LENGTH                   equ 0001h
PID1OUTLH_OUT10_MASK                     equ 0004h
PID1OUTLH_OUT11_POSN                     equ 0003h
PID1OUTLH_OUT11_POSITION                 equ 0003h
PID1OUTLH_OUT11_SIZE                     equ 0001h
PID1OUTLH_OUT11_LENGTH                   equ 0001h
PID1OUTLH_OUT11_MASK                     equ 0008h
PID1OUTLH_OUT12_POSN                     equ 0004h
PID1OUTLH_OUT12_POSITION                 equ 0004h
PID1OUTLH_OUT12_SIZE                     equ 0001h
PID1OUTLH_OUT12_LENGTH                   equ 0001h
PID1OUTLH_OUT12_MASK                     equ 0010h
PID1OUTLH_OUT13_POSN                     equ 0005h
PID1OUTLH_OUT13_POSITION                 equ 0005h
PID1OUTLH_OUT13_SIZE                     equ 0001h
PID1OUTLH_OUT13_LENGTH                   equ 0001h
PID1OUTLH_OUT13_MASK                     equ 0020h
PID1OUTLH_OUT14_POSN                     equ 0006h
PID1OUTLH_OUT14_POSITION                 equ 0006h
PID1OUTLH_OUT14_SIZE                     equ 0001h
PID1OUTLH_OUT14_LENGTH                   equ 0001h
PID1OUTLH_OUT14_MASK                     equ 0040h
PID1OUTLH_OUT15_POSN                     equ 0007h
PID1OUTLH_OUT15_POSITION                 equ 0007h
PID1OUTLH_OUT15_SIZE                     equ 0001h
PID1OUTLH_OUT15_LENGTH                   equ 0001h
PID1OUTLH_OUT15_MASK                     equ 0080h

// Register: PID1OUTHL
#define PID1OUTHL PID1OUTHL
PID1OUTHL                                equ 0598h
// bitfield definitions
PID1OUTHL_PID1OUT16_POSN                 equ 0000h
PID1OUTHL_PID1OUT16_POSITION             equ 0000h
PID1OUTHL_PID1OUT16_SIZE                 equ 0001h
PID1OUTHL_PID1OUT16_LENGTH               equ 0001h
PID1OUTHL_PID1OUT16_MASK                 equ 0001h
PID1OUTHL_PID1OUT17_POSN                 equ 0001h
PID1OUTHL_PID1OUT17_POSITION             equ 0001h
PID1OUTHL_PID1OUT17_SIZE                 equ 0001h
PID1OUTHL_PID1OUT17_LENGTH               equ 0001h
PID1OUTHL_PID1OUT17_MASK                 equ 0002h
PID1OUTHL_PID1OUT18_POSN                 equ 0002h
PID1OUTHL_PID1OUT18_POSITION             equ 0002h
PID1OUTHL_PID1OUT18_SIZE                 equ 0001h
PID1OUTHL_PID1OUT18_LENGTH               equ 0001h
PID1OUTHL_PID1OUT18_MASK                 equ 0004h
PID1OUTHL_PID1OUT19_POSN                 equ 0003h
PID1OUTHL_PID1OUT19_POSITION             equ 0003h
PID1OUTHL_PID1OUT19_SIZE                 equ 0001h
PID1OUTHL_PID1OUT19_LENGTH               equ 0001h
PID1OUTHL_PID1OUT19_MASK                 equ 0008h
PID1OUTHL_PID1OUT20_POSN                 equ 0004h
PID1OUTHL_PID1OUT20_POSITION             equ 0004h
PID1OUTHL_PID1OUT20_SIZE                 equ 0001h
PID1OUTHL_PID1OUT20_LENGTH               equ 0001h
PID1OUTHL_PID1OUT20_MASK                 equ 0010h
PID1OUTHL_PID1OUT21_POSN                 equ 0005h
PID1OUTHL_PID1OUT21_POSITION             equ 0005h
PID1OUTHL_PID1OUT21_SIZE                 equ 0001h
PID1OUTHL_PID1OUT21_LENGTH               equ 0001h
PID1OUTHL_PID1OUT21_MASK                 equ 0020h
PID1OUTHL_PID1OUT22_POSN                 equ 0006h
PID1OUTHL_PID1OUT22_POSITION             equ 0006h
PID1OUTHL_PID1OUT22_SIZE                 equ 0001h
PID1OUTHL_PID1OUT22_LENGTH               equ 0001h
PID1OUTHL_PID1OUT22_MASK                 equ 0040h
PID1OUTHL_PID1OUT23_POSN                 equ 0007h
PID1OUTHL_PID1OUT23_POSITION             equ 0007h
PID1OUTHL_PID1OUT23_SIZE                 equ 0001h
PID1OUTHL_PID1OUT23_LENGTH               equ 0001h
PID1OUTHL_PID1OUT23_MASK                 equ 0080h
PID1OUTHL_OUT16_POSN                     equ 0000h
PID1OUTHL_OUT16_POSITION                 equ 0000h
PID1OUTHL_OUT16_SIZE                     equ 0001h
PID1OUTHL_OUT16_LENGTH                   equ 0001h
PID1OUTHL_OUT16_MASK                     equ 0001h
PID1OUTHL_OUT17_POSN                     equ 0001h
PID1OUTHL_OUT17_POSITION                 equ 0001h
PID1OUTHL_OUT17_SIZE                     equ 0001h
PID1OUTHL_OUT17_LENGTH                   equ 0001h
PID1OUTHL_OUT17_MASK                     equ 0002h
PID1OUTHL_OUT18_POSN                     equ 0002h
PID1OUTHL_OUT18_POSITION                 equ 0002h
PID1OUTHL_OUT18_SIZE                     equ 0001h
PID1OUTHL_OUT18_LENGTH                   equ 0001h
PID1OUTHL_OUT18_MASK                     equ 0004h
PID1OUTHL_OUT19_POSN                     equ 0003h
PID1OUTHL_OUT19_POSITION                 equ 0003h
PID1OUTHL_OUT19_SIZE                     equ 0001h
PID1OUTHL_OUT19_LENGTH                   equ 0001h
PID1OUTHL_OUT19_MASK                     equ 0008h
PID1OUTHL_OUT20_POSN                     equ 0004h
PID1OUTHL_OUT20_POSITION                 equ 0004h
PID1OUTHL_OUT20_SIZE                     equ 0001h
PID1OUTHL_OUT20_LENGTH                   equ 0001h
PID1OUTHL_OUT20_MASK                     equ 0010h
PID1OUTHL_OUT21_POSN                     equ 0005h
PID1OUTHL_OUT21_POSITION                 equ 0005h
PID1OUTHL_OUT21_SIZE                     equ 0001h
PID1OUTHL_OUT21_LENGTH                   equ 0001h
PID1OUTHL_OUT21_MASK                     equ 0020h
PID1OUTHL_OUT22_POSN                     equ 0006h
PID1OUTHL_OUT22_POSITION                 equ 0006h
PID1OUTHL_OUT22_SIZE                     equ 0001h
PID1OUTHL_OUT22_LENGTH                   equ 0001h
PID1OUTHL_OUT22_MASK                     equ 0040h
PID1OUTHL_OUT23_POSN                     equ 0007h
PID1OUTHL_OUT23_POSITION                 equ 0007h
PID1OUTHL_OUT23_SIZE                     equ 0001h
PID1OUTHL_OUT23_LENGTH                   equ 0001h
PID1OUTHL_OUT23_MASK                     equ 0080h

// Register: PID1OUTHH
#define PID1OUTHH PID1OUTHH
PID1OUTHH                                equ 0599h
// bitfield definitions
PID1OUTHH_PID1OUT24_POSN                 equ 0000h
PID1OUTHH_PID1OUT24_POSITION             equ 0000h
PID1OUTHH_PID1OUT24_SIZE                 equ 0001h
PID1OUTHH_PID1OUT24_LENGTH               equ 0001h
PID1OUTHH_PID1OUT24_MASK                 equ 0001h
PID1OUTHH_PID1OUT25_POSN                 equ 0001h
PID1OUTHH_PID1OUT25_POSITION             equ 0001h
PID1OUTHH_PID1OUT25_SIZE                 equ 0001h
PID1OUTHH_PID1OUT25_LENGTH               equ 0001h
PID1OUTHH_PID1OUT25_MASK                 equ 0002h
PID1OUTHH_PID1OUT26_POSN                 equ 0002h
PID1OUTHH_PID1OUT26_POSITION             equ 0002h
PID1OUTHH_PID1OUT26_SIZE                 equ 0001h
PID1OUTHH_PID1OUT26_LENGTH               equ 0001h
PID1OUTHH_PID1OUT26_MASK                 equ 0004h
PID1OUTHH_PID1OUT27_POSN                 equ 0003h
PID1OUTHH_PID1OUT27_POSITION             equ 0003h
PID1OUTHH_PID1OUT27_SIZE                 equ 0001h
PID1OUTHH_PID1OUT27_LENGTH               equ 0001h
PID1OUTHH_PID1OUT27_MASK                 equ 0008h
PID1OUTHH_PID1OUT28_POSN                 equ 0004h
PID1OUTHH_PID1OUT28_POSITION             equ 0004h
PID1OUTHH_PID1OUT28_SIZE                 equ 0001h
PID1OUTHH_PID1OUT28_LENGTH               equ 0001h
PID1OUTHH_PID1OUT28_MASK                 equ 0010h
PID1OUTHH_PID1OUT29_POSN                 equ 0005h
PID1OUTHH_PID1OUT29_POSITION             equ 0005h
PID1OUTHH_PID1OUT29_SIZE                 equ 0001h
PID1OUTHH_PID1OUT29_LENGTH               equ 0001h
PID1OUTHH_PID1OUT29_MASK                 equ 0020h
PID1OUTHH_PID1OUT30_POSN                 equ 0006h
PID1OUTHH_PID1OUT30_POSITION             equ 0006h
PID1OUTHH_PID1OUT30_SIZE                 equ 0001h
PID1OUTHH_PID1OUT30_LENGTH               equ 0001h
PID1OUTHH_PID1OUT30_MASK                 equ 0040h
PID1OUTHH_PID1OUT31_POSN                 equ 0007h
PID1OUTHH_PID1OUT31_POSITION             equ 0007h
PID1OUTHH_PID1OUT31_SIZE                 equ 0001h
PID1OUTHH_PID1OUT31_LENGTH               equ 0001h
PID1OUTHH_PID1OUT31_MASK                 equ 0080h
PID1OUTHH_OUT24_POSN                     equ 0000h
PID1OUTHH_OUT24_POSITION                 equ 0000h
PID1OUTHH_OUT24_SIZE                     equ 0001h
PID1OUTHH_OUT24_LENGTH                   equ 0001h
PID1OUTHH_OUT24_MASK                     equ 0001h
PID1OUTHH_OUT25_POSN                     equ 0001h
PID1OUTHH_OUT25_POSITION                 equ 0001h
PID1OUTHH_OUT25_SIZE                     equ 0001h
PID1OUTHH_OUT25_LENGTH                   equ 0001h
PID1OUTHH_OUT25_MASK                     equ 0002h
PID1OUTHH_OUT26_POSN                     equ 0002h
PID1OUTHH_OUT26_POSITION                 equ 0002h
PID1OUTHH_OUT26_SIZE                     equ 0001h
PID1OUTHH_OUT26_LENGTH                   equ 0001h
PID1OUTHH_OUT26_MASK                     equ 0004h
PID1OUTHH_OUT27_POSN                     equ 0003h
PID1OUTHH_OUT27_POSITION                 equ 0003h
PID1OUTHH_OUT27_SIZE                     equ 0001h
PID1OUTHH_OUT27_LENGTH                   equ 0001h
PID1OUTHH_OUT27_MASK                     equ 0008h
PID1OUTHH_OUT28_POSN                     equ 0004h
PID1OUTHH_OUT28_POSITION                 equ 0004h
PID1OUTHH_OUT28_SIZE                     equ 0001h
PID1OUTHH_OUT28_LENGTH                   equ 0001h
PID1OUTHH_OUT28_MASK                     equ 0010h
PID1OUTHH_OUT29_POSN                     equ 0005h
PID1OUTHH_OUT29_POSITION                 equ 0005h
PID1OUTHH_OUT29_SIZE                     equ 0001h
PID1OUTHH_OUT29_LENGTH                   equ 0001h
PID1OUTHH_OUT29_MASK                     equ 0020h
PID1OUTHH_OUT30_POSN                     equ 0006h
PID1OUTHH_OUT30_POSITION                 equ 0006h
PID1OUTHH_OUT30_SIZE                     equ 0001h
PID1OUTHH_OUT30_LENGTH                   equ 0001h
PID1OUTHH_OUT30_MASK                     equ 0040h
PID1OUTHH_OUT31_POSN                     equ 0007h
PID1OUTHH_OUT31_POSITION                 equ 0007h
PID1OUTHH_OUT31_SIZE                     equ 0001h
PID1OUTHH_OUT31_LENGTH                   equ 0001h
PID1OUTHH_OUT31_MASK                     equ 0080h

// Register: PID1OUTU
#define PID1OUTU PID1OUTU
PID1OUTU                                 equ 059Ah
// bitfield definitions
PID1OUTU_PID1OUT32_POSN                  equ 0000h
PID1OUTU_PID1OUT32_POSITION              equ 0000h
PID1OUTU_PID1OUT32_SIZE                  equ 0001h
PID1OUTU_PID1OUT32_LENGTH                equ 0001h
PID1OUTU_PID1OUT32_MASK                  equ 0001h
PID1OUTU_PID1OUT33_POSN                  equ 0001h
PID1OUTU_PID1OUT33_POSITION              equ 0001h
PID1OUTU_PID1OUT33_SIZE                  equ 0001h
PID1OUTU_PID1OUT33_LENGTH                equ 0001h
PID1OUTU_PID1OUT33_MASK                  equ 0002h
PID1OUTU_PID1OUT34_POSN                  equ 0002h
PID1OUTU_PID1OUT34_POSITION              equ 0002h
PID1OUTU_PID1OUT34_SIZE                  equ 0001h
PID1OUTU_PID1OUT34_LENGTH                equ 0001h
PID1OUTU_PID1OUT34_MASK                  equ 0004h
PID1OUTU_PID1OUT35_POSN                  equ 0003h
PID1OUTU_PID1OUT35_POSITION              equ 0003h
PID1OUTU_PID1OUT35_SIZE                  equ 0001h
PID1OUTU_PID1OUT35_LENGTH                equ 0001h
PID1OUTU_PID1OUT35_MASK                  equ 0008h
PID1OUTU_OUT32_POSN                      equ 0000h
PID1OUTU_OUT32_POSITION                  equ 0000h
PID1OUTU_OUT32_SIZE                      equ 0001h
PID1OUTU_OUT32_LENGTH                    equ 0001h
PID1OUTU_OUT32_MASK                      equ 0001h
PID1OUTU_OUT33_POSN                      equ 0001h
PID1OUTU_OUT33_POSITION                  equ 0001h
PID1OUTU_OUT33_SIZE                      equ 0001h
PID1OUTU_OUT33_LENGTH                    equ 0001h
PID1OUTU_OUT33_MASK                      equ 0002h
PID1OUTU_OUT34_POSN                      equ 0002h
PID1OUTU_OUT34_POSITION                  equ 0002h
PID1OUTU_OUT34_SIZE                      equ 0001h
PID1OUTU_OUT34_LENGTH                    equ 0001h
PID1OUTU_OUT34_MASK                      equ 0004h
PID1OUTU_OUT35_POSN                      equ 0003h
PID1OUTU_OUT35_POSITION                  equ 0003h
PID1OUTU_OUT35_SIZE                      equ 0001h
PID1OUTU_OUT35_LENGTH                    equ 0001h
PID1OUTU_OUT35_MASK                      equ 0008h

