GopalSaraf/Practicals/PSDL/include/proc/pic16lf1619.inc
// Register: PID1Z1L
#define PID1Z1L PID1Z1L
PID1Z1L                                  equ 059Bh
// bitfield definitions
PID1Z1L_PID1Z10_POSN                     equ 0000h
PID1Z1L_PID1Z10_POSITION                 equ 0000h
PID1Z1L_PID1Z10_SIZE                     equ 0001h
PID1Z1L_PID1Z10_LENGTH                   equ 0001h
PID1Z1L_PID1Z10_MASK                     equ 0001h
PID1Z1L_PID1Z11_POSN                     equ 0001h
PID1Z1L_PID1Z11_POSITION                 equ 0001h
PID1Z1L_PID1Z11_SIZE                     equ 0001h
PID1Z1L_PID1Z11_LENGTH                   equ 0001h
PID1Z1L_PID1Z11_MASK                     equ 0002h
PID1Z1L_PID1Z12_POSN                     equ 0002h
PID1Z1L_PID1Z12_POSITION                 equ 0002h
PID1Z1L_PID1Z12_SIZE                     equ 0001h
PID1Z1L_PID1Z12_LENGTH                   equ 0001h
PID1Z1L_PID1Z12_MASK                     equ 0004h
PID1Z1L_PID1Z13_POSN                     equ 0003h
PID1Z1L_PID1Z13_POSITION                 equ 0003h
PID1Z1L_PID1Z13_SIZE                     equ 0001h
PID1Z1L_PID1Z13_LENGTH                   equ 0001h
PID1Z1L_PID1Z13_MASK                     equ 0008h
PID1Z1L_PID1Z14_POSN                     equ 0004h
PID1Z1L_PID1Z14_POSITION                 equ 0004h
PID1Z1L_PID1Z14_SIZE                     equ 0001h
PID1Z1L_PID1Z14_LENGTH                   equ 0001h
PID1Z1L_PID1Z14_MASK                     equ 0010h
PID1Z1L_PID1Z15_POSN                     equ 0005h
PID1Z1L_PID1Z15_POSITION                 equ 0005h
PID1Z1L_PID1Z15_SIZE                     equ 0001h
PID1Z1L_PID1Z15_LENGTH                   equ 0001h
PID1Z1L_PID1Z15_MASK                     equ 0020h
PID1Z1L_PID1Z16_POSN                     equ 0006h
PID1Z1L_PID1Z16_POSITION                 equ 0006h
PID1Z1L_PID1Z16_SIZE                     equ 0001h
PID1Z1L_PID1Z16_LENGTH                   equ 0001h
PID1Z1L_PID1Z16_MASK                     equ 0040h
PID1Z1L_PID1Z17_POSN                     equ 0007h
PID1Z1L_PID1Z17_POSITION                 equ 0007h
PID1Z1L_PID1Z17_SIZE                     equ 0001h
PID1Z1L_PID1Z17_LENGTH                   equ 0001h
PID1Z1L_PID1Z17_MASK                     equ 0080h
PID1Z1L_Z10_POSN                         equ 0000h
PID1Z1L_Z10_POSITION                     equ 0000h
PID1Z1L_Z10_SIZE                         equ 0001h
PID1Z1L_Z10_LENGTH                       equ 0001h
PID1Z1L_Z10_MASK                         equ 0001h
PID1Z1L_Z11_POSN                         equ 0001h
PID1Z1L_Z11_POSITION                     equ 0001h
PID1Z1L_Z11_SIZE                         equ 0001h
PID1Z1L_Z11_LENGTH                       equ 0001h
PID1Z1L_Z11_MASK                         equ 0002h
PID1Z1L_Z12_POSN                         equ 0002h
PID1Z1L_Z12_POSITION                     equ 0002h
PID1Z1L_Z12_SIZE                         equ 0001h
PID1Z1L_Z12_LENGTH                       equ 0001h
PID1Z1L_Z12_MASK                         equ 0004h
PID1Z1L_Z13_POSN                         equ 0003h
PID1Z1L_Z13_POSITION                     equ 0003h
PID1Z1L_Z13_SIZE                         equ 0001h
PID1Z1L_Z13_LENGTH                       equ 0001h
PID1Z1L_Z13_MASK                         equ 0008h
PID1Z1L_Z14_POSN                         equ 0004h
PID1Z1L_Z14_POSITION                     equ 0004h
PID1Z1L_Z14_SIZE                         equ 0001h
PID1Z1L_Z14_LENGTH                       equ 0001h
PID1Z1L_Z14_MASK                         equ 0010h
PID1Z1L_Z15_POSN                         equ 0005h
PID1Z1L_Z15_POSITION                     equ 0005h
PID1Z1L_Z15_SIZE                         equ 0001h
PID1Z1L_Z15_LENGTH                       equ 0001h
PID1Z1L_Z15_MASK                         equ 0020h
PID1Z1L_Z16_POSN                         equ 0006h
PID1Z1L_Z16_POSITION                     equ 0006h
PID1Z1L_Z16_SIZE                         equ 0001h
PID1Z1L_Z16_LENGTH                       equ 0001h
PID1Z1L_Z16_MASK                         equ 0040h
PID1Z1L_Z17_POSN                         equ 0007h
PID1Z1L_Z17_POSITION                     equ 0007h
PID1Z1L_Z17_SIZE                         equ 0001h
PID1Z1L_Z17_LENGTH                       equ 0001h
PID1Z1L_Z17_MASK                         equ 0080h

// Register: PID1Z1H
#define PID1Z1H PID1Z1H
PID1Z1H                                  equ 059Ch
// bitfield definitions
PID1Z1H_PID1Z18_POSN                     equ 0000h
PID1Z1H_PID1Z18_POSITION                 equ 0000h
PID1Z1H_PID1Z18_SIZE                     equ 0001h
PID1Z1H_PID1Z18_LENGTH                   equ 0001h
PID1Z1H_PID1Z18_MASK                     equ 0001h
PID1Z1H_PID1Z19_POSN                     equ 0001h
PID1Z1H_PID1Z19_POSITION                 equ 0001h
PID1Z1H_PID1Z19_SIZE                     equ 0001h
PID1Z1H_PID1Z19_LENGTH                   equ 0001h
PID1Z1H_PID1Z19_MASK                     equ 0002h
PID1Z1H_PID1Z110_POSN                    equ 0002h
PID1Z1H_PID1Z110_POSITION                equ 0002h
PID1Z1H_PID1Z110_SIZE                    equ 0001h
PID1Z1H_PID1Z110_LENGTH                  equ 0001h
PID1Z1H_PID1Z110_MASK                    equ 0004h
PID1Z1H_PID1Z111_POSN                    equ 0003h
PID1Z1H_PID1Z111_POSITION                equ 0003h
PID1Z1H_PID1Z111_SIZE                    equ 0001h
PID1Z1H_PID1Z111_LENGTH                  equ 0001h
PID1Z1H_PID1Z111_MASK                    equ 0008h
PID1Z1H_PID1Z112_POSN                    equ 0004h
PID1Z1H_PID1Z112_POSITION                equ 0004h
PID1Z1H_PID1Z112_SIZE                    equ 0001h
PID1Z1H_PID1Z112_LENGTH                  equ 0001h
PID1Z1H_PID1Z112_MASK                    equ 0010h
PID1Z1H_PID1Z113_POSN                    equ 0005h
PID1Z1H_PID1Z113_POSITION                equ 0005h
PID1Z1H_PID1Z113_SIZE                    equ 0001h
PID1Z1H_PID1Z113_LENGTH                  equ 0001h
PID1Z1H_PID1Z113_MASK                    equ 0020h
PID1Z1H_PID1Z114_POSN                    equ 0006h
PID1Z1H_PID1Z114_POSITION                equ 0006h
PID1Z1H_PID1Z114_SIZE                    equ 0001h
PID1Z1H_PID1Z114_LENGTH                  equ 0001h
PID1Z1H_PID1Z114_MASK                    equ 0040h
PID1Z1H_PID1Z115_POSN                    equ 0007h
PID1Z1H_PID1Z115_POSITION                equ 0007h
PID1Z1H_PID1Z115_SIZE                    equ 0001h
PID1Z1H_PID1Z115_LENGTH                  equ 0001h
PID1Z1H_PID1Z115_MASK                    equ 0080h
PID1Z1H_Z18_POSN                         equ 0000h
PID1Z1H_Z18_POSITION                     equ 0000h
PID1Z1H_Z18_SIZE                         equ 0001h
PID1Z1H_Z18_LENGTH                       equ 0001h
PID1Z1H_Z18_MASK                         equ 0001h
PID1Z1H_Z19_POSN                         equ 0001h
PID1Z1H_Z19_POSITION                     equ 0001h
PID1Z1H_Z19_SIZE                         equ 0001h
PID1Z1H_Z19_LENGTH                       equ 0001h
PID1Z1H_Z19_MASK                         equ 0002h
PID1Z1H_Z110_POSN                        equ 0002h
PID1Z1H_Z110_POSITION                    equ 0002h
PID1Z1H_Z110_SIZE                        equ 0001h
PID1Z1H_Z110_LENGTH                      equ 0001h
PID1Z1H_Z110_MASK                        equ 0004h
PID1Z1H_Z111_POSN                        equ 0003h
PID1Z1H_Z111_POSITION                    equ 0003h
PID1Z1H_Z111_SIZE                        equ 0001h
PID1Z1H_Z111_LENGTH                      equ 0001h
PID1Z1H_Z111_MASK                        equ 0008h
PID1Z1H_Z112_POSN                        equ 0004h
PID1Z1H_Z112_POSITION                    equ 0004h
PID1Z1H_Z112_SIZE                        equ 0001h
PID1Z1H_Z112_LENGTH                      equ 0001h
PID1Z1H_Z112_MASK                        equ 0010h
PID1Z1H_Z113_POSN                        equ 0005h
PID1Z1H_Z113_POSITION                    equ 0005h
PID1Z1H_Z113_SIZE                        equ 0001h
PID1Z1H_Z113_LENGTH                      equ 0001h
PID1Z1H_Z113_MASK                        equ 0020h
PID1Z1H_Z114_POSN                        equ 0006h
PID1Z1H_Z114_POSITION                    equ 0006h
PID1Z1H_Z114_SIZE                        equ 0001h
PID1Z1H_Z114_LENGTH                      equ 0001h
PID1Z1H_Z114_MASK                        equ 0040h
PID1Z1H_Z115_POSN                        equ 0007h
PID1Z1H_Z115_POSITION                    equ 0007h
PID1Z1H_Z115_SIZE                        equ 0001h
PID1Z1H_Z115_LENGTH                      equ 0001h
PID1Z1H_Z115_MASK                        equ 0080h

// Register: PID1Z1U
#define PID1Z1U PID1Z1U
PID1Z1U                                  equ 059Dh
// bitfield definitions
PID1Z1U_PID1Z116_POSN                    equ 0000h
PID1Z1U_PID1Z116_POSITION                equ 0000h
PID1Z1U_PID1Z116_SIZE                    equ 0001h
PID1Z1U_PID1Z116_LENGTH                  equ 0001h
PID1Z1U_PID1Z116_MASK                    equ 0001h
PID1Z1U_Z116_POSN                        equ 0000h
PID1Z1U_Z116_POSITION                    equ 0000h
PID1Z1U_Z116_SIZE                        equ 0001h
PID1Z1U_Z116_LENGTH                      equ 0001h
PID1Z1U_Z116_MASK                        equ 0001h

