GopalSaraf/Practicals/PSDL/include/proc/pic16lf1619.inc
// Register: SCANLADRL
#define SCANLADRL SCANLADRL
SCANLADRL                                equ 0718h
// bitfield definitions
SCANLADRL_LADR_POSN                      equ 0000h
SCANLADRL_LADR_POSITION                  equ 0000h
SCANLADRL_LADR_SIZE                      equ 0008h
SCANLADRL_LADR_LENGTH                    equ 0008h
SCANLADRL_LADR_MASK                      equ 00FFh
SCANLADRL_LDAR0_POSN                     equ 0000h
SCANLADRL_LDAR0_POSITION                 equ 0000h
SCANLADRL_LDAR0_SIZE                     equ 0001h
SCANLADRL_LDAR0_LENGTH                   equ 0001h
SCANLADRL_LDAR0_MASK                     equ 0001h
SCANLADRL_LDAR1_POSN                     equ 0001h
SCANLADRL_LDAR1_POSITION                 equ 0001h
SCANLADRL_LDAR1_SIZE                     equ 0001h
SCANLADRL_LDAR1_LENGTH                   equ 0001h
SCANLADRL_LDAR1_MASK                     equ 0002h
SCANLADRL_LADR2_POSN                     equ 0002h
SCANLADRL_LADR2_POSITION                 equ 0002h
SCANLADRL_LADR2_SIZE                     equ 0001h
SCANLADRL_LADR2_LENGTH                   equ 0001h
SCANLADRL_LADR2_MASK                     equ 0004h
SCANLADRL_LADR3_POSN                     equ 0003h
SCANLADRL_LADR3_POSITION                 equ 0003h
SCANLADRL_LADR3_SIZE                     equ 0001h
SCANLADRL_LADR3_LENGTH                   equ 0001h
SCANLADRL_LADR3_MASK                     equ 0008h
SCANLADRL_LADR4_POSN                     equ 0004h
SCANLADRL_LADR4_POSITION                 equ 0004h
SCANLADRL_LADR4_SIZE                     equ 0001h
SCANLADRL_LADR4_LENGTH                   equ 0001h
SCANLADRL_LADR4_MASK                     equ 0010h
SCANLADRL_LADR5_POSN                     equ 0005h
SCANLADRL_LADR5_POSITION                 equ 0005h
SCANLADRL_LADR5_SIZE                     equ 0001h
SCANLADRL_LADR5_LENGTH                   equ 0001h
SCANLADRL_LADR5_MASK                     equ 0020h
SCANLADRL_LADR6_POSN                     equ 0006h
SCANLADRL_LADR6_POSITION                 equ 0006h
SCANLADRL_LADR6_SIZE                     equ 0001h
SCANLADRL_LADR6_LENGTH                   equ 0001h
SCANLADRL_LADR6_MASK                     equ 0040h
SCANLADRL_LADR7_POSN                     equ 0007h
SCANLADRL_LADR7_POSITION                 equ 0007h
SCANLADRL_LADR7_SIZE                     equ 0001h
SCANLADRL_LADR7_LENGTH                   equ 0001h
SCANLADRL_LADR7_MASK                     equ 0080h
SCANLADRL_SCANLADR_POSN                  equ 0000h
SCANLADRL_SCANLADR_POSITION              equ 0000h
SCANLADRL_SCANLADR_SIZE                  equ 0008h
SCANLADRL_SCANLADR_LENGTH                equ 0008h
SCANLADRL_SCANLADR_MASK                  equ 00FFh
SCANLADRL_SCANLADR0_POSN                 equ 0000h
SCANLADRL_SCANLADR0_POSITION             equ 0000h
SCANLADRL_SCANLADR0_SIZE                 equ 0001h
SCANLADRL_SCANLADR0_LENGTH               equ 0001h
SCANLADRL_SCANLADR0_MASK                 equ 0001h
SCANLADRL_SCANLADR1_POSN                 equ 0001h
SCANLADRL_SCANLADR1_POSITION             equ 0001h
SCANLADRL_SCANLADR1_SIZE                 equ 0001h
SCANLADRL_SCANLADR1_LENGTH               equ 0001h
SCANLADRL_SCANLADR1_MASK                 equ 0002h
SCANLADRL_SCANLADR2_POSN                 equ 0002h
SCANLADRL_SCANLADR2_POSITION             equ 0002h
SCANLADRL_SCANLADR2_SIZE                 equ 0001h
SCANLADRL_SCANLADR2_LENGTH               equ 0001h
SCANLADRL_SCANLADR2_MASK                 equ 0004h
SCANLADRL_SCANLADR3_POSN                 equ 0003h
SCANLADRL_SCANLADR3_POSITION             equ 0003h
SCANLADRL_SCANLADR3_SIZE                 equ 0001h
SCANLADRL_SCANLADR3_LENGTH               equ 0001h
SCANLADRL_SCANLADR3_MASK                 equ 0008h
SCANLADRL_SCANLADR4_POSN                 equ 0004h
SCANLADRL_SCANLADR4_POSITION             equ 0004h
SCANLADRL_SCANLADR4_SIZE                 equ 0001h
SCANLADRL_SCANLADR4_LENGTH               equ 0001h
SCANLADRL_SCANLADR4_MASK                 equ 0010h
SCANLADRL_SCANLADR5_POSN                 equ 0005h
SCANLADRL_SCANLADR5_POSITION             equ 0005h
SCANLADRL_SCANLADR5_SIZE                 equ 0001h
SCANLADRL_SCANLADR5_LENGTH               equ 0001h
SCANLADRL_SCANLADR5_MASK                 equ 0020h
SCANLADRL_SCANLADR6_POSN                 equ 0006h
SCANLADRL_SCANLADR6_POSITION             equ 0006h
SCANLADRL_SCANLADR6_SIZE                 equ 0001h
SCANLADRL_SCANLADR6_LENGTH               equ 0001h
SCANLADRL_SCANLADR6_MASK                 equ 0040h
SCANLADRL_SCANLADR7_POSN                 equ 0007h
SCANLADRL_SCANLADR7_POSITION             equ 0007h
SCANLADRL_SCANLADR7_SIZE                 equ 0001h
SCANLADRL_SCANLADR7_LENGTH               equ 0001h
SCANLADRL_SCANLADR7_MASK                 equ 0080h

// Register: SCANLADRH
#define SCANLADRH SCANLADRH
SCANLADRH                                equ 0719h
// bitfield definitions
SCANLADRH_LADR_POSN                      equ 0000h
SCANLADRH_LADR_POSITION                  equ 0000h
SCANLADRH_LADR_SIZE                      equ 0008h
SCANLADRH_LADR_LENGTH                    equ 0008h
SCANLADRH_LADR_MASK                      equ 00FFh
SCANLADRH_LADR8_POSN                     equ 0000h
SCANLADRH_LADR8_POSITION                 equ 0000h
SCANLADRH_LADR8_SIZE                     equ 0001h
SCANLADRH_LADR8_LENGTH                   equ 0001h
SCANLADRH_LADR8_MASK                     equ 0001h
SCANLADRH_LADR9_POSN                     equ 0001h
SCANLADRH_LADR9_POSITION                 equ 0001h
SCANLADRH_LADR9_SIZE                     equ 0001h
SCANLADRH_LADR9_LENGTH                   equ 0001h
SCANLADRH_LADR9_MASK                     equ 0002h
SCANLADRH_LADR10_POSN                    equ 0002h
SCANLADRH_LADR10_POSITION                equ 0002h
SCANLADRH_LADR10_SIZE                    equ 0001h
SCANLADRH_LADR10_LENGTH                  equ 0001h
SCANLADRH_LADR10_MASK                    equ 0004h
SCANLADRH_LADR11_POSN                    equ 0003h
SCANLADRH_LADR11_POSITION                equ 0003h
SCANLADRH_LADR11_SIZE                    equ 0001h
SCANLADRH_LADR11_LENGTH                  equ 0001h
SCANLADRH_LADR11_MASK                    equ 0008h
SCANLADRH_LADR12_POSN                    equ 0004h
SCANLADRH_LADR12_POSITION                equ 0004h
SCANLADRH_LADR12_SIZE                    equ 0001h
SCANLADRH_LADR12_LENGTH                  equ 0001h
SCANLADRH_LADR12_MASK                    equ 0010h
SCANLADRH_LADR13_POSN                    equ 0005h
SCANLADRH_LADR13_POSITION                equ 0005h
SCANLADRH_LADR13_SIZE                    equ 0001h
SCANLADRH_LADR13_LENGTH                  equ 0001h
SCANLADRH_LADR13_MASK                    equ 0020h
SCANLADRH_LADR14_POSN                    equ 0006h
SCANLADRH_LADR14_POSITION                equ 0006h
SCANLADRH_LADR14_SIZE                    equ 0001h
SCANLADRH_LADR14_LENGTH                  equ 0001h
SCANLADRH_LADR14_MASK                    equ 0040h
SCANLADRH_LADR15_POSN                    equ 0007h
SCANLADRH_LADR15_POSITION                equ 0007h
SCANLADRH_LADR15_SIZE                    equ 0001h
SCANLADRH_LADR15_LENGTH                  equ 0001h
SCANLADRH_LADR15_MASK                    equ 0080h
SCANLADRH_SCANLADR_POSN                  equ 0000h
SCANLADRH_SCANLADR_POSITION              equ 0000h
SCANLADRH_SCANLADR_SIZE                  equ 0008h
SCANLADRH_SCANLADR_LENGTH                equ 0008h
SCANLADRH_SCANLADR_MASK                  equ 00FFh
SCANLADRH_SCANLADR8_POSN                 equ 0000h
SCANLADRH_SCANLADR8_POSITION             equ 0000h
SCANLADRH_SCANLADR8_SIZE                 equ 0001h
SCANLADRH_SCANLADR8_LENGTH               equ 0001h
SCANLADRH_SCANLADR8_MASK                 equ 0001h
SCANLADRH_SCANLADR9_POSN                 equ 0001h
SCANLADRH_SCANLADR9_POSITION             equ 0001h
SCANLADRH_SCANLADR9_SIZE                 equ 0001h
SCANLADRH_SCANLADR9_LENGTH               equ 0001h
SCANLADRH_SCANLADR9_MASK                 equ 0002h
SCANLADRH_SCANLADR10_POSN                equ 0002h
SCANLADRH_SCANLADR10_POSITION            equ 0002h
SCANLADRH_SCANLADR10_SIZE                equ 0001h
SCANLADRH_SCANLADR10_LENGTH              equ 0001h
SCANLADRH_SCANLADR10_MASK                equ 0004h
SCANLADRH_SCANLADR11_POSN                equ 0003h
SCANLADRH_SCANLADR11_POSITION            equ 0003h
SCANLADRH_SCANLADR11_SIZE                equ 0001h
SCANLADRH_SCANLADR11_LENGTH              equ 0001h
SCANLADRH_SCANLADR11_MASK                equ 0008h
SCANLADRH_SCANLADR12_POSN                equ 0004h
SCANLADRH_SCANLADR12_POSITION            equ 0004h
SCANLADRH_SCANLADR12_SIZE                equ 0001h
SCANLADRH_SCANLADR12_LENGTH              equ 0001h
SCANLADRH_SCANLADR12_MASK                equ 0010h
SCANLADRH_SCANLADR13_POSN                equ 0005h
SCANLADRH_SCANLADR13_POSITION            equ 0005h
SCANLADRH_SCANLADR13_SIZE                equ 0001h
SCANLADRH_SCANLADR13_LENGTH              equ 0001h
SCANLADRH_SCANLADR13_MASK                equ 0020h
SCANLADRH_SCANLADR14_POSN                equ 0006h
SCANLADRH_SCANLADR14_POSITION            equ 0006h
SCANLADRH_SCANLADR14_SIZE                equ 0001h
SCANLADRH_SCANLADR14_LENGTH              equ 0001h
SCANLADRH_SCANLADR14_MASK                equ 0040h
SCANLADRH_SCANLADR15_POSN                equ 0007h
SCANLADRH_SCANLADR15_POSITION            equ 0007h
SCANLADRH_SCANLADR15_SIZE                equ 0001h
SCANLADRH_SCANLADR15_LENGTH              equ 0001h
SCANLADRH_SCANLADR15_MASK                equ 0080h

// Register: SCANHADRL
#define SCANHADRL SCANHADRL
SCANHADRL                                equ 071Ah
// bitfield definitions
SCANHADRL_HADR_POSN                      equ 0000h
SCANHADRL_HADR_POSITION                  equ 0000h
SCANHADRL_HADR_SIZE                      equ 0008h
SCANHADRL_HADR_LENGTH                    equ 0008h
SCANHADRL_HADR_MASK                      equ 00FFh
SCANHADRL_HADR0_POSN                     equ 0000h
SCANHADRL_HADR0_POSITION                 equ 0000h
SCANHADRL_HADR0_SIZE                     equ 0001h
SCANHADRL_HADR0_LENGTH                   equ 0001h
SCANHADRL_HADR0_MASK                     equ 0001h
SCANHADRL_HADR1_POSN                     equ 0001h
SCANHADRL_HADR1_POSITION                 equ 0001h
SCANHADRL_HADR1_SIZE                     equ 0001h
SCANHADRL_HADR1_LENGTH                   equ 0001h
SCANHADRL_HADR1_MASK                     equ 0002h
SCANHADRL_HARD2_POSN                     equ 0002h
SCANHADRL_HARD2_POSITION                 equ 0002h
SCANHADRL_HARD2_SIZE                     equ 0001h
SCANHADRL_HARD2_LENGTH                   equ 0001h
SCANHADRL_HARD2_MASK                     equ 0004h
SCANHADRL_HADR3_POSN                     equ 0003h
SCANHADRL_HADR3_POSITION                 equ 0003h
SCANHADRL_HADR3_SIZE                     equ 0001h
SCANHADRL_HADR3_LENGTH                   equ 0001h
SCANHADRL_HADR3_MASK                     equ 0008h
SCANHADRL_HADR4_POSN                     equ 0004h
SCANHADRL_HADR4_POSITION                 equ 0004h
SCANHADRL_HADR4_SIZE                     equ 0001h
SCANHADRL_HADR4_LENGTH                   equ 0001h
SCANHADRL_HADR4_MASK                     equ 0010h
SCANHADRL_HADR5_POSN                     equ 0005h
SCANHADRL_HADR5_POSITION                 equ 0005h
SCANHADRL_HADR5_SIZE                     equ 0001h
SCANHADRL_HADR5_LENGTH                   equ 0001h
SCANHADRL_HADR5_MASK                     equ 0020h
SCANHADRL_HADR6_POSN                     equ 0006h
SCANHADRL_HADR6_POSITION                 equ 0006h
SCANHADRL_HADR6_SIZE                     equ 0001h
SCANHADRL_HADR6_LENGTH                   equ 0001h
SCANHADRL_HADR6_MASK                     equ 0040h
SCANHADRL_HADR7_POSN                     equ 0007h
SCANHADRL_HADR7_POSITION                 equ 0007h
SCANHADRL_HADR7_SIZE                     equ 0001h
SCANHADRL_HADR7_LENGTH                   equ 0001h
SCANHADRL_HADR7_MASK                     equ 0080h
SCANHADRL_SCANHADR_POSN                  equ 0000h
SCANHADRL_SCANHADR_POSITION              equ 0000h
SCANHADRL_SCANHADR_SIZE                  equ 0008h
SCANHADRL_SCANHADR_LENGTH                equ 0008h
SCANHADRL_SCANHADR_MASK                  equ 00FFh
SCANHADRL_SCANHADR0_POSN                 equ 0000h
SCANHADRL_SCANHADR0_POSITION             equ 0000h
SCANHADRL_SCANHADR0_SIZE                 equ 0001h
SCANHADRL_SCANHADR0_LENGTH               equ 0001h
SCANHADRL_SCANHADR0_MASK                 equ 0001h
SCANHADRL_SCANHADR1_POSN                 equ 0001h
SCANHADRL_SCANHADR1_POSITION             equ 0001h
SCANHADRL_SCANHADR1_SIZE                 equ 0001h
SCANHADRL_SCANHADR1_LENGTH               equ 0001h
SCANHADRL_SCANHADR1_MASK                 equ 0002h
SCANHADRL_SCANHADR2_POSN                 equ 0002h
SCANHADRL_SCANHADR2_POSITION             equ 0002h
SCANHADRL_SCANHADR2_SIZE                 equ 0001h
SCANHADRL_SCANHADR2_LENGTH               equ 0001h
SCANHADRL_SCANHADR2_MASK                 equ 0004h
SCANHADRL_SCANHADR3_POSN                 equ 0003h
SCANHADRL_SCANHADR3_POSITION             equ 0003h
SCANHADRL_SCANHADR3_SIZE                 equ 0001h
SCANHADRL_SCANHADR3_LENGTH               equ 0001h
SCANHADRL_SCANHADR3_MASK                 equ 0008h
SCANHADRL_SCANHADR4_POSN                 equ 0004h
SCANHADRL_SCANHADR4_POSITION             equ 0004h
SCANHADRL_SCANHADR4_SIZE                 equ 0001h
SCANHADRL_SCANHADR4_LENGTH               equ 0001h
SCANHADRL_SCANHADR4_MASK                 equ 0010h
SCANHADRL_SCANHADR5_POSN                 equ 0005h
SCANHADRL_SCANHADR5_POSITION             equ 0005h
SCANHADRL_SCANHADR5_SIZE                 equ 0001h
SCANHADRL_SCANHADR5_LENGTH               equ 0001h
SCANHADRL_SCANHADR5_MASK                 equ 0020h
SCANHADRL_SCANHADR6_POSN                 equ 0006h
SCANHADRL_SCANHADR6_POSITION             equ 0006h
SCANHADRL_SCANHADR6_SIZE                 equ 0001h
SCANHADRL_SCANHADR6_LENGTH               equ 0001h
SCANHADRL_SCANHADR6_MASK                 equ 0040h
SCANHADRL_SCANHADR7_POSN                 equ 0007h
SCANHADRL_SCANHADR7_POSITION             equ 0007h
SCANHADRL_SCANHADR7_SIZE                 equ 0001h
SCANHADRL_SCANHADR7_LENGTH               equ 0001h
SCANHADRL_SCANHADR7_MASK                 equ 0080h

// Register: SCANHADRH
#define SCANHADRH SCANHADRH
SCANHADRH                                equ 071Bh
// bitfield definitions
SCANHADRH_HADR_POSN                      equ 0000h
SCANHADRH_HADR_POSITION                  equ 0000h
SCANHADRH_HADR_SIZE                      equ 0008h
SCANHADRH_HADR_LENGTH                    equ 0008h
SCANHADRH_HADR_MASK                      equ 00FFh
SCANHADRH_HADR8_POSN                     equ 0000h
SCANHADRH_HADR8_POSITION                 equ 0000h
SCANHADRH_HADR8_SIZE                     equ 0001h
SCANHADRH_HADR8_LENGTH                   equ 0001h
SCANHADRH_HADR8_MASK                     equ 0001h
SCANHADRH_HADR9_POSN                     equ 0001h
SCANHADRH_HADR9_POSITION                 equ 0001h
SCANHADRH_HADR9_SIZE                     equ 0001h
SCANHADRH_HADR9_LENGTH                   equ 0001h
SCANHADRH_HADR9_MASK                     equ 0002h
SCANHADRH_HADR10_POSN                    equ 0002h
SCANHADRH_HADR10_POSITION                equ 0002h
SCANHADRH_HADR10_SIZE                    equ 0001h
SCANHADRH_HADR10_LENGTH                  equ 0001h
SCANHADRH_HADR10_MASK                    equ 0004h
SCANHADRH_HADR11_POSN                    equ 0003h
SCANHADRH_HADR11_POSITION                equ 0003h
SCANHADRH_HADR11_SIZE                    equ 0001h
SCANHADRH_HADR11_LENGTH                  equ 0001h
SCANHADRH_HADR11_MASK                    equ 0008h
SCANHADRH_HADR12_POSN                    equ 0004h
SCANHADRH_HADR12_POSITION                equ 0004h
SCANHADRH_HADR12_SIZE                    equ 0001h
SCANHADRH_HADR12_LENGTH                  equ 0001h
SCANHADRH_HADR12_MASK                    equ 0010h
SCANHADRH_HADR13_POSN                    equ 0005h
SCANHADRH_HADR13_POSITION                equ 0005h
SCANHADRH_HADR13_SIZE                    equ 0001h
SCANHADRH_HADR13_LENGTH                  equ 0001h
SCANHADRH_HADR13_MASK                    equ 0020h
SCANHADRH_HADR14_POSN                    equ 0006h
SCANHADRH_HADR14_POSITION                equ 0006h
SCANHADRH_HADR14_SIZE                    equ 0001h
SCANHADRH_HADR14_LENGTH                  equ 0001h
SCANHADRH_HADR14_MASK                    equ 0040h
SCANHADRH_HADR15_POSN                    equ 0007h
SCANHADRH_HADR15_POSITION                equ 0007h
SCANHADRH_HADR15_SIZE                    equ 0001h
SCANHADRH_HADR15_LENGTH                  equ 0001h
SCANHADRH_HADR15_MASK                    equ 0080h
SCANHADRH_SCANHADR_POSN                  equ 0000h
SCANHADRH_SCANHADR_POSITION              equ 0000h
SCANHADRH_SCANHADR_SIZE                  equ 0008h
SCANHADRH_SCANHADR_LENGTH                equ 0008h
SCANHADRH_SCANHADR_MASK                  equ 00FFh
SCANHADRH_SCANHADR8_POSN                 equ 0000h
SCANHADRH_SCANHADR8_POSITION             equ 0000h
SCANHADRH_SCANHADR8_SIZE                 equ 0001h
SCANHADRH_SCANHADR8_LENGTH               equ 0001h
SCANHADRH_SCANHADR8_MASK                 equ 0001h
SCANHADRH_SCANHADR9_POSN                 equ 0001h
SCANHADRH_SCANHADR9_POSITION             equ 0001h
SCANHADRH_SCANHADR9_SIZE                 equ 0001h
SCANHADRH_SCANHADR9_LENGTH               equ 0001h
SCANHADRH_SCANHADR9_MASK                 equ 0002h
SCANHADRH_SCANHADR10_POSN                equ 0002h
SCANHADRH_SCANHADR10_POSITION            equ 0002h
SCANHADRH_SCANHADR10_SIZE                equ 0001h
SCANHADRH_SCANHADR10_LENGTH              equ 0001h
SCANHADRH_SCANHADR10_MASK                equ 0004h
SCANHADRH_SCANHADR11_POSN                equ 0003h
SCANHADRH_SCANHADR11_POSITION            equ 0003h
SCANHADRH_SCANHADR11_SIZE                equ 0001h
SCANHADRH_SCANHADR11_LENGTH              equ 0001h
SCANHADRH_SCANHADR11_MASK                equ 0008h
SCANHADRH_SCANHADR12_POSN                equ 0004h
SCANHADRH_SCANHADR12_POSITION            equ 0004h
SCANHADRH_SCANHADR12_SIZE                equ 0001h
SCANHADRH_SCANHADR12_LENGTH              equ 0001h
SCANHADRH_SCANHADR12_MASK                equ 0010h
SCANHADRH_SCANHADR13_POSN                equ 0005h
SCANHADRH_SCANHADR13_POSITION            equ 0005h
SCANHADRH_SCANHADR13_SIZE                equ 0001h
SCANHADRH_SCANHADR13_LENGTH              equ 0001h
SCANHADRH_SCANHADR13_MASK                equ 0020h
SCANHADRH_SCANHADR14_POSN                equ 0006h
SCANHADRH_SCANHADR14_POSITION            equ 0006h
SCANHADRH_SCANHADR14_SIZE                equ 0001h
SCANHADRH_SCANHADR14_LENGTH              equ 0001h
SCANHADRH_SCANHADR14_MASK                equ 0040h
SCANHADRH_SCANHADR15_POSN                equ 0007h
SCANHADRH_SCANHADR15_POSITION            equ 0007h
SCANHADRH_SCANHADR15_SIZE                equ 0001h
SCANHADRH_SCANHADR15_LENGTH              equ 0001h
SCANHADRH_SCANHADR15_MASK                equ 0080h

// Register: SCANCON0
#define SCANCON0 SCANCON0
SCANCON0                                 equ 071Ch
// bitfield definitions
SCANCON0_MODE_POSN                       equ 0000h
SCANCON0_MODE_POSITION                   equ 0000h
SCANCON0_MODE_SIZE                       equ 0002h
SCANCON0_MODE_LENGTH                     equ 0002h
SCANCON0_MODE_MASK                       equ 0003h
SCANCON0_INTM_POSN                       equ 0003h
SCANCON0_INTM_POSITION                   equ 0003h
SCANCON0_INTM_SIZE                       equ 0001h
SCANCON0_INTM_LENGTH                     equ 0001h
SCANCON0_INTM_MASK                       equ 0008h
SCANCON0_INVALID_POSN                    equ 0004h
SCANCON0_INVALID_POSITION                equ 0004h
SCANCON0_INVALID_SIZE                    equ 0001h
SCANCON0_INVALID_LENGTH                  equ 0001h
SCANCON0_INVALID_MASK                    equ 0010h
SCANCON0_BUSY_POSN                       equ 0005h
SCANCON0_BUSY_POSITION                   equ 0005h
SCANCON0_BUSY_SIZE                       equ 0001h
SCANCON0_BUSY_LENGTH                     equ 0001h
SCANCON0_BUSY_MASK                       equ 0020h
SCANCON0_SCANGO_POSN                     equ 0006h
SCANCON0_SCANGO_POSITION                 equ 0006h
SCANCON0_SCANGO_SIZE                     equ 0001h
SCANCON0_SCANGO_LENGTH                   equ 0001h
SCANCON0_SCANGO_MASK                     equ 0040h
SCANCON0_EN_POSN                         equ 0007h
SCANCON0_EN_POSITION                     equ 0007h
SCANCON0_EN_SIZE                         equ 0001h
SCANCON0_EN_LENGTH                       equ 0001h
SCANCON0_EN_MASK                         equ 0080h
SCANCON0_MODE0_POSN                      equ 0000h
SCANCON0_MODE0_POSITION                  equ 0000h
SCANCON0_MODE0_SIZE                      equ 0001h
SCANCON0_MODE0_LENGTH                    equ 0001h
SCANCON0_MODE0_MASK                      equ 0001h
SCANCON0_MODE1_POSN                      equ 0001h
SCANCON0_MODE1_POSITION                  equ 0001h
SCANCON0_MODE1_SIZE                      equ 0001h
SCANCON0_MODE1_LENGTH                    equ 0001h
SCANCON0_MODE1_MASK                      equ 0002h
SCANCON0_SCANMODE_POSN                   equ 0000h
SCANCON0_SCANMODE_POSITION               equ 0000h
SCANCON0_SCANMODE_SIZE                   equ 0002h
SCANCON0_SCANMODE_LENGTH                 equ 0002h
SCANCON0_SCANMODE_MASK                   equ 0003h
SCANCON0_SCANINTM_POSN                   equ 0003h
SCANCON0_SCANINTM_POSITION               equ 0003h
SCANCON0_SCANINTM_SIZE                   equ 0001h
SCANCON0_SCANINTM_LENGTH                 equ 0001h
SCANCON0_SCANINTM_MASK                   equ 0008h
SCANCON0_SCANINVALID_POSN                equ 0004h
SCANCON0_SCANINVALID_POSITION            equ 0004h
SCANCON0_SCANINVALID_SIZE                equ 0001h
SCANCON0_SCANINVALID_LENGTH              equ 0001h
SCANCON0_SCANINVALID_MASK                equ 0010h
SCANCON0_SCANBUSY_POSN                   equ 0005h
SCANCON0_SCANBUSY_POSITION               equ 0005h
SCANCON0_SCANBUSY_SIZE                   equ 0001h
SCANCON0_SCANBUSY_LENGTH                 equ 0001h
SCANCON0_SCANBUSY_MASK                   equ 0020h
SCANCON0_SCANEN_POSN                     equ 0007h
SCANCON0_SCANEN_POSITION                 equ 0007h
SCANCON0_SCANEN_SIZE                     equ 0001h
SCANCON0_SCANEN_LENGTH                   equ 0001h
SCANCON0_SCANEN_MASK                     equ 0080h
SCANCON0_SCANMODE0_POSN                  equ 0000h
SCANCON0_SCANMODE0_POSITION              equ 0000h
SCANCON0_SCANMODE0_SIZE                  equ 0001h
SCANCON0_SCANMODE0_LENGTH                equ 0001h
SCANCON0_SCANMODE0_MASK                  equ 0001h
SCANCON0_SCANMODE1_POSN                  equ 0001h
SCANCON0_SCANMODE1_POSITION              equ 0001h
SCANCON0_SCANMODE1_SIZE                  equ 0001h
SCANCON0_SCANMODE1_LENGTH                equ 0001h
SCANCON0_SCANMODE1_MASK                  equ 0002h

