GopalSaraf/Practicals/PSDL/include/proc/pic16lf1619.inc
// Register: AT1MISSH
#define AT1MISSH AT1MISSH
AT1MISSH                                 equ 080Fh
// bitfield definitions
AT1MISSH_AT1MISS8_POSN                   equ 0000h
AT1MISSH_AT1MISS8_POSITION               equ 0000h
AT1MISSH_AT1MISS8_SIZE                   equ 0001h
AT1MISSH_AT1MISS8_LENGTH                 equ 0001h
AT1MISSH_AT1MISS8_MASK                   equ 0001h
AT1MISSH_AT1MISS9_POSN                   equ 0001h
AT1MISSH_AT1MISS9_POSITION               equ 0001h
AT1MISSH_AT1MISS9_SIZE                   equ 0001h
AT1MISSH_AT1MISS9_LENGTH                 equ 0001h
AT1MISSH_AT1MISS9_MASK                   equ 0002h
AT1MISSH_AT1MISS10_POSN                  equ 0002h
AT1MISSH_AT1MISS10_POSITION              equ 0002h
AT1MISSH_AT1MISS10_SIZE                  equ 0001h
AT1MISSH_AT1MISS10_LENGTH                equ 0001h
AT1MISSH_AT1MISS10_MASK                  equ 0004h
AT1MISSH_AT1MISS11_POSN                  equ 0003h
AT1MISSH_AT1MISS11_POSITION              equ 0003h
AT1MISSH_AT1MISS11_SIZE                  equ 0001h
AT1MISSH_AT1MISS11_LENGTH                equ 0001h
AT1MISSH_AT1MISS11_MASK                  equ 0008h
AT1MISSH_AT1MISS12_POSN                  equ 0004h
AT1MISSH_AT1MISS12_POSITION              equ 0004h
AT1MISSH_AT1MISS12_SIZE                  equ 0001h
AT1MISSH_AT1MISS12_LENGTH                equ 0001h
AT1MISSH_AT1MISS12_MASK                  equ 0010h
AT1MISSH_AT1MISS13_POSN                  equ 0005h
AT1MISSH_AT1MISS13_POSITION              equ 0005h
AT1MISSH_AT1MISS13_SIZE                  equ 0001h
AT1MISSH_AT1MISS13_LENGTH                equ 0001h
AT1MISSH_AT1MISS13_MASK                  equ 0020h
AT1MISSH_AT1MISS14_POSN                  equ 0006h
AT1MISSH_AT1MISS14_POSITION              equ 0006h
AT1MISSH_AT1MISS14_SIZE                  equ 0001h
AT1MISSH_AT1MISS14_LENGTH                equ 0001h
AT1MISSH_AT1MISS14_MASK                  equ 0040h
AT1MISSH_AT1MISS15_POSN                  equ 0007h
AT1MISSH_AT1MISS15_POSITION              equ 0007h
AT1MISSH_AT1MISS15_SIZE                  equ 0001h
AT1MISSH_AT1MISS15_LENGTH                equ 0001h
AT1MISSH_AT1MISS15_MASK                  equ 0080h
AT1MISSH_MISS8_POSN                      equ 0000h
AT1MISSH_MISS8_POSITION                  equ 0000h
AT1MISSH_MISS8_SIZE                      equ 0001h
AT1MISSH_MISS8_LENGTH                    equ 0001h
AT1MISSH_MISS8_MASK                      equ 0001h
AT1MISSH_MISS9_POSN                      equ 0001h
AT1MISSH_MISS9_POSITION                  equ 0001h
AT1MISSH_MISS9_SIZE                      equ 0001h
AT1MISSH_MISS9_LENGTH                    equ 0001h
AT1MISSH_MISS9_MASK                      equ 0002h
AT1MISSH_MISS10_POSN                     equ 0002h
AT1MISSH_MISS10_POSITION                 equ 0002h
AT1MISSH_MISS10_SIZE                     equ 0001h
AT1MISSH_MISS10_LENGTH                   equ 0001h
AT1MISSH_MISS10_MASK                     equ 0004h
AT1MISSH_MISS11_POSN                     equ 0003h
AT1MISSH_MISS11_POSITION                 equ 0003h
AT1MISSH_MISS11_SIZE                     equ 0001h
AT1MISSH_MISS11_LENGTH                   equ 0001h
AT1MISSH_MISS11_MASK                     equ 0008h
AT1MISSH_MISS12_POSN                     equ 0004h
AT1MISSH_MISS12_POSITION                 equ 0004h
AT1MISSH_MISS12_SIZE                     equ 0001h
AT1MISSH_MISS12_LENGTH                   equ 0001h
AT1MISSH_MISS12_MASK                     equ 0010h
AT1MISSH_MISS13_POSN                     equ 0005h
AT1MISSH_MISS13_POSITION                 equ 0005h
AT1MISSH_MISS13_SIZE                     equ 0001h
AT1MISSH_MISS13_LENGTH                   equ 0001h
AT1MISSH_MISS13_MASK                     equ 0020h
AT1MISSH_MISS14_POSN                     equ 0006h
AT1MISSH_MISS14_POSITION                 equ 0006h
AT1MISSH_MISS14_SIZE                     equ 0001h
AT1MISSH_MISS14_LENGTH                   equ 0001h
AT1MISSH_MISS14_MASK                     equ 0040h
AT1MISSH_MISS15_POSN                     equ 0007h
AT1MISSH_MISS15_POSITION                 equ 0007h
AT1MISSH_MISS15_SIZE                     equ 0001h
AT1MISSH_MISS15_LENGTH                   equ 0001h
AT1MISSH_MISS15_MASK                     equ 0080h

// Register: AT1PERL
#define AT1PERL AT1PERL
AT1PERL                                  equ 0810h
// bitfield definitions
AT1PERL_AT1PER0_POSN                     equ 0000h
AT1PERL_AT1PER0_POSITION                 equ 0000h
AT1PERL_AT1PER0_SIZE                     equ 0001h
AT1PERL_AT1PER0_LENGTH                   equ 0001h
AT1PERL_AT1PER0_MASK                     equ 0001h
AT1PERL_AT1PER1_POSN                     equ 0001h
AT1PERL_AT1PER1_POSITION                 equ 0001h
AT1PERL_AT1PER1_SIZE                     equ 0001h
AT1PERL_AT1PER1_LENGTH                   equ 0001h
AT1PERL_AT1PER1_MASK                     equ 0002h
AT1PERL_AT1PER2_POSN                     equ 0002h
AT1PERL_AT1PER2_POSITION                 equ 0002h
AT1PERL_AT1PER2_SIZE                     equ 0001h
AT1PERL_AT1PER2_LENGTH                   equ 0001h
AT1PERL_AT1PER2_MASK                     equ 0004h
AT1PERL_AT1PER3_POSN                     equ 0003h
AT1PERL_AT1PER3_POSITION                 equ 0003h
AT1PERL_AT1PER3_SIZE                     equ 0001h
AT1PERL_AT1PER3_LENGTH                   equ 0001h
AT1PERL_AT1PER3_MASK                     equ 0008h
AT1PERL_AT1PER4_POSN                     equ 0004h
AT1PERL_AT1PER4_POSITION                 equ 0004h
AT1PERL_AT1PER4_SIZE                     equ 0001h
AT1PERL_AT1PER4_LENGTH                   equ 0001h
AT1PERL_AT1PER4_MASK                     equ 0010h
AT1PERL_AT1PER5_POSN                     equ 0005h
AT1PERL_AT1PER5_POSITION                 equ 0005h
AT1PERL_AT1PER5_SIZE                     equ 0001h
AT1PERL_AT1PER5_LENGTH                   equ 0001h
AT1PERL_AT1PER5_MASK                     equ 0020h
AT1PERL_AT1PER6_POSN                     equ 0006h
AT1PERL_AT1PER6_POSITION                 equ 0006h
AT1PERL_AT1PER6_SIZE                     equ 0001h
AT1PERL_AT1PER6_LENGTH                   equ 0001h
AT1PERL_AT1PER6_MASK                     equ 0040h
AT1PERL_AT1PER7_POSN                     equ 0007h
AT1PERL_AT1PER7_POSITION                 equ 0007h
AT1PERL_AT1PER7_SIZE                     equ 0001h
AT1PERL_AT1PER7_LENGTH                   equ 0001h
AT1PERL_AT1PER7_MASK                     equ 0080h
AT1PERL_PER0_POSN                        equ 0000h
AT1PERL_PER0_POSITION                    equ 0000h
AT1PERL_PER0_SIZE                        equ 0001h
AT1PERL_PER0_LENGTH                      equ 0001h
AT1PERL_PER0_MASK                        equ 0001h
AT1PERL_PER1_POSN                        equ 0001h
AT1PERL_PER1_POSITION                    equ 0001h
AT1PERL_PER1_SIZE                        equ 0001h
AT1PERL_PER1_LENGTH                      equ 0001h
AT1PERL_PER1_MASK                        equ 0002h
AT1PERL_PER2_POSN                        equ 0002h
AT1PERL_PER2_POSITION                    equ 0002h
AT1PERL_PER2_SIZE                        equ 0001h
AT1PERL_PER2_LENGTH                      equ 0001h
AT1PERL_PER2_MASK                        equ 0004h
AT1PERL_PER3_POSN                        equ 0003h
AT1PERL_PER3_POSITION                    equ 0003h
AT1PERL_PER3_SIZE                        equ 0001h
AT1PERL_PER3_LENGTH                      equ 0001h
AT1PERL_PER3_MASK                        equ 0008h
AT1PERL_PER4_POSN                        equ 0004h
AT1PERL_PER4_POSITION                    equ 0004h
AT1PERL_PER4_SIZE                        equ 0001h
AT1PERL_PER4_LENGTH                      equ 0001h
AT1PERL_PER4_MASK                        equ 0010h
AT1PERL_PER5_POSN                        equ 0005h
AT1PERL_PER5_POSITION                    equ 0005h
AT1PERL_PER5_SIZE                        equ 0001h
AT1PERL_PER5_LENGTH                      equ 0001h
AT1PERL_PER5_MASK                        equ 0020h
AT1PERL_PER6_POSN                        equ 0006h
AT1PERL_PER6_POSITION                    equ 0006h
AT1PERL_PER6_SIZE                        equ 0001h
AT1PERL_PER6_LENGTH                      equ 0001h
AT1PERL_PER6_MASK                        equ 0040h
AT1PERL_PER7_POSN                        equ 0007h
AT1PERL_PER7_POSITION                    equ 0007h
AT1PERL_PER7_SIZE                        equ 0001h
AT1PERL_PER7_LENGTH                      equ 0001h
AT1PERL_PER7_MASK                        equ 0080h
AT1PERL_PERL0_POSN                       equ 0000h
AT1PERL_PERL0_POSITION                   equ 0000h
AT1PERL_PERL0_SIZE                       equ 0001h
AT1PERL_PERL0_LENGTH                     equ 0001h
AT1PERL_PERL0_MASK                       equ 0001h
AT1PERL_PERL1_POSN                       equ 0001h
AT1PERL_PERL1_POSITION                   equ 0001h
AT1PERL_PERL1_SIZE                       equ 0001h
AT1PERL_PERL1_LENGTH                     equ 0001h
AT1PERL_PERL1_MASK                       equ 0002h
AT1PERL_PERL2_POSN                       equ 0002h
AT1PERL_PERL2_POSITION                   equ 0002h
AT1PERL_PERL2_SIZE                       equ 0001h
AT1PERL_PERL2_LENGTH                     equ 0001h
AT1PERL_PERL2_MASK                       equ 0004h
AT1PERL_PERL3_POSN                       equ 0003h
AT1PERL_PERL3_POSITION                   equ 0003h
AT1PERL_PERL3_SIZE                       equ 0001h
AT1PERL_PERL3_LENGTH                     equ 0001h
AT1PERL_PERL3_MASK                       equ 0008h
AT1PERL_PERL4_POSN                       equ 0004h
AT1PERL_PERL4_POSITION                   equ 0004h
AT1PERL_PERL4_SIZE                       equ 0001h
AT1PERL_PERL4_LENGTH                     equ 0001h
AT1PERL_PERL4_MASK                       equ 0010h
AT1PERL_PERL5_POSN                       equ 0005h
AT1PERL_PERL5_POSITION                   equ 0005h
AT1PERL_PERL5_SIZE                       equ 0001h
AT1PERL_PERL5_LENGTH                     equ 0001h
AT1PERL_PERL5_MASK                       equ 0020h
AT1PERL_PERL6_POSN                       equ 0006h
AT1PERL_PERL6_POSITION                   equ 0006h
AT1PERL_PERL6_SIZE                       equ 0001h
AT1PERL_PERL6_LENGTH                     equ 0001h
AT1PERL_PERL6_MASK                       equ 0040h
AT1PERL_PERL7_POSN                       equ 0007h
AT1PERL_PERL7_POSITION                   equ 0007h
AT1PERL_PERL7_SIZE                       equ 0001h
AT1PERL_PERL7_LENGTH                     equ 0001h
AT1PERL_PERL7_MASK                       equ 0080h

// Register: AT1PERH
#define AT1PERH AT1PERH
AT1PERH                                  equ 0811h
// bitfield definitions
AT1PERH_AT1PER8_POSN                     equ 0000h
AT1PERH_AT1PER8_POSITION                 equ 0000h
AT1PERH_AT1PER8_SIZE                     equ 0001h
AT1PERH_AT1PER8_LENGTH                   equ 0001h
AT1PERH_AT1PER8_MASK                     equ 0001h
AT1PERH_AT1PER9_POSN                     equ 0001h
AT1PERH_AT1PER9_POSITION                 equ 0001h
AT1PERH_AT1PER9_SIZE                     equ 0001h
AT1PERH_AT1PER9_LENGTH                   equ 0001h
AT1PERH_AT1PER9_MASK                     equ 0002h
AT1PERH_AT1PER10_POSN                    equ 0002h
AT1PERH_AT1PER10_POSITION                equ 0002h
AT1PERH_AT1PER10_SIZE                    equ 0001h
AT1PERH_AT1PER10_LENGTH                  equ 0001h
AT1PERH_AT1PER10_MASK                    equ 0004h
AT1PERH_AT1PER11_POSN                    equ 0003h
AT1PERH_AT1PER11_POSITION                equ 0003h
AT1PERH_AT1PER11_SIZE                    equ 0001h
AT1PERH_AT1PER11_LENGTH                  equ 0001h
AT1PERH_AT1PER11_MASK                    equ 0008h
AT1PERH_AT1PER12_POSN                    equ 0004h
AT1PERH_AT1PER12_POSITION                equ 0004h
AT1PERH_AT1PER12_SIZE                    equ 0001h
AT1PERH_AT1PER12_LENGTH                  equ 0001h
AT1PERH_AT1PER12_MASK                    equ 0010h
AT1PERH_AT1PER13_POSN                    equ 0005h
AT1PERH_AT1PER13_POSITION                equ 0005h
AT1PERH_AT1PER13_SIZE                    equ 0001h
AT1PERH_AT1PER13_LENGTH                  equ 0001h
AT1PERH_AT1PER13_MASK                    equ 0020h
AT1PERH_AT1PER14_POSN                    equ 0006h
AT1PERH_AT1PER14_POSITION                equ 0006h
AT1PERH_AT1PER14_SIZE                    equ 0001h
AT1PERH_AT1PER14_LENGTH                  equ 0001h
AT1PERH_AT1PER14_MASK                    equ 0040h
AT1PERH_AT1POV_POSN                      equ 0007h
AT1PERH_AT1POV_POSITION                  equ 0007h
AT1PERH_AT1POV_SIZE                      equ 0001h
AT1PERH_AT1POV_LENGTH                    equ 0001h
AT1PERH_AT1POV_MASK                      equ 0080h
AT1PERH_PER8_POSN                        equ 0000h
AT1PERH_PER8_POSITION                    equ 0000h
AT1PERH_PER8_SIZE                        equ 0001h
AT1PERH_PER8_LENGTH                      equ 0001h
AT1PERH_PER8_MASK                        equ 0001h
AT1PERH_PER9_POSN                        equ 0001h
AT1PERH_PER9_POSITION                    equ 0001h
AT1PERH_PER9_SIZE                        equ 0001h
AT1PERH_PER9_LENGTH                      equ 0001h
AT1PERH_PER9_MASK                        equ 0002h
AT1PERH_PER10_POSN                       equ 0002h
AT1PERH_PER10_POSITION                   equ 0002h
AT1PERH_PER10_SIZE                       equ 0001h
AT1PERH_PER10_LENGTH                     equ 0001h
AT1PERH_PER10_MASK                       equ 0004h
AT1PERH_PER11_POSN                       equ 0003h
AT1PERH_PER11_POSITION                   equ 0003h
AT1PERH_PER11_SIZE                       equ 0001h
AT1PERH_PER11_LENGTH                     equ 0001h
AT1PERH_PER11_MASK                       equ 0008h
AT1PERH_PER12_POSN                       equ 0004h
AT1PERH_PER12_POSITION                   equ 0004h
AT1PERH_PER12_SIZE                       equ 0001h
AT1PERH_PER12_LENGTH                     equ 0001h
AT1PERH_PER12_MASK                       equ 0010h
AT1PERH_PER13_POSN                       equ 0005h
AT1PERH_PER13_POSITION                   equ 0005h
AT1PERH_PER13_SIZE                       equ 0001h
AT1PERH_PER13_LENGTH                     equ 0001h
AT1PERH_PER13_MASK                       equ 0020h
AT1PERH_PER14_POSN                       equ 0006h
AT1PERH_PER14_POSITION                   equ 0006h
AT1PERH_PER14_SIZE                       equ 0001h
AT1PERH_PER14_LENGTH                     equ 0001h
AT1PERH_PER14_MASK                       equ 0040h
AT1PERH_PER15_POSN                       equ 0007h
AT1PERH_PER15_POSITION                   equ 0007h
AT1PERH_PER15_SIZE                       equ 0001h
AT1PERH_PER15_LENGTH                     equ 0001h
AT1PERH_PER15_MASK                       equ 0080h
AT1PERH_PERH0_POSN                       equ 0000h
AT1PERH_PERH0_POSITION                   equ 0000h
AT1PERH_PERH0_SIZE                       equ 0001h
AT1PERH_PERH0_LENGTH                     equ 0001h
AT1PERH_PERH0_MASK                       equ 0001h
AT1PERH_PERH1_POSN                       equ 0001h
AT1PERH_PERH1_POSITION                   equ 0001h
AT1PERH_PERH1_SIZE                       equ 0001h
AT1PERH_PERH1_LENGTH                     equ 0001h
AT1PERH_PERH1_MASK                       equ 0002h
AT1PERH_PERH2_POSN                       equ 0002h
AT1PERH_PERH2_POSITION                   equ 0002h
AT1PERH_PERH2_SIZE                       equ 0001h
AT1PERH_PERH2_LENGTH                     equ 0001h
AT1PERH_PERH2_MASK                       equ 0004h
AT1PERH_PERH3_POSN                       equ 0003h
AT1PERH_PERH3_POSITION                   equ 0003h
AT1PERH_PERH3_SIZE                       equ 0001h
AT1PERH_PERH3_LENGTH                     equ 0001h
AT1PERH_PERH3_MASK                       equ 0008h
AT1PERH_PERH4_POSN                       equ 0004h
AT1PERH_PERH4_POSITION                   equ 0004h
AT1PERH_PERH4_SIZE                       equ 0001h
AT1PERH_PERH4_LENGTH                     equ 0001h
AT1PERH_PERH4_MASK                       equ 0010h
AT1PERH_PERH5_POSN                       equ 0005h
AT1PERH_PERH5_POSITION                   equ 0005h
AT1PERH_PERH5_SIZE                       equ 0001h
AT1PERH_PERH5_LENGTH                     equ 0001h
AT1PERH_PERH5_MASK                       equ 0020h
AT1PERH_PERH6_POSN                       equ 0006h
AT1PERH_PERH6_POSITION                   equ 0006h
AT1PERH_PERH6_SIZE                       equ 0001h
AT1PERH_PERH6_LENGTH                     equ 0001h
AT1PERH_PERH6_MASK                       equ 0040h
AT1PERH_PERH7_POSN                       equ 0007h
AT1PERH_PERH7_POSITION                   equ 0007h
AT1PERH_PERH7_SIZE                       equ 0001h
AT1PERH_PERH7_LENGTH                     equ 0001h
AT1PERH_PERH7_MASK                       equ 0080h

// Register: AT1PHSL
#define AT1PHSL AT1PHSL
AT1PHSL                                  equ 0812h
// bitfield definitions
AT1PHSL_AT1PHS0_POSN                     equ 0000h
AT1PHSL_AT1PHS0_POSITION                 equ 0000h
AT1PHSL_AT1PHS0_SIZE                     equ 0001h
AT1PHSL_AT1PHS0_LENGTH                   equ 0001h
AT1PHSL_AT1PHS0_MASK                     equ 0001h
AT1PHSL_AT1PHS1_POSN                     equ 0001h
AT1PHSL_AT1PHS1_POSITION                 equ 0001h
AT1PHSL_AT1PHS1_SIZE                     equ 0001h
AT1PHSL_AT1PHS1_LENGTH                   equ 0001h
AT1PHSL_AT1PHS1_MASK                     equ 0002h
AT1PHSL_AT1PHS2_POSN                     equ 0002h
AT1PHSL_AT1PHS2_POSITION                 equ 0002h
AT1PHSL_AT1PHS2_SIZE                     equ 0001h
AT1PHSL_AT1PHS2_LENGTH                   equ 0001h
AT1PHSL_AT1PHS2_MASK                     equ 0004h
AT1PHSL_AT1PHS3_POSN                     equ 0003h
AT1PHSL_AT1PHS3_POSITION                 equ 0003h
AT1PHSL_AT1PHS3_SIZE                     equ 0001h
AT1PHSL_AT1PHS3_LENGTH                   equ 0001h
AT1PHSL_AT1PHS3_MASK                     equ 0008h
AT1PHSL_AT1PHS4_POSN                     equ 0004h
AT1PHSL_AT1PHS4_POSITION                 equ 0004h
AT1PHSL_AT1PHS4_SIZE                     equ 0001h
AT1PHSL_AT1PHS4_LENGTH                   equ 0001h
AT1PHSL_AT1PHS4_MASK                     equ 0010h
AT1PHSL_AT1PHS5_POSN                     equ 0005h
AT1PHSL_AT1PHS5_POSITION                 equ 0005h
AT1PHSL_AT1PHS5_SIZE                     equ 0001h
AT1PHSL_AT1PHS5_LENGTH                   equ 0001h
AT1PHSL_AT1PHS5_MASK                     equ 0020h
AT1PHSL_AT1PHS6_POSN                     equ 0006h
AT1PHSL_AT1PHS6_POSITION                 equ 0006h
AT1PHSL_AT1PHS6_SIZE                     equ 0001h
AT1PHSL_AT1PHS6_LENGTH                   equ 0001h
AT1PHSL_AT1PHS6_MASK                     equ 0040h
AT1PHSL_AT1PHS7_POSN                     equ 0007h
AT1PHSL_AT1PHS7_POSITION                 equ 0007h
AT1PHSL_AT1PHS7_SIZE                     equ 0001h
AT1PHSL_AT1PHS7_LENGTH                   equ 0001h
AT1PHSL_AT1PHS7_MASK                     equ 0080h
AT1PHSL_PHS0_POSN                        equ 0000h
AT1PHSL_PHS0_POSITION                    equ 0000h
AT1PHSL_PHS0_SIZE                        equ 0001h
AT1PHSL_PHS0_LENGTH                      equ 0001h
AT1PHSL_PHS0_MASK                        equ 0001h
AT1PHSL_PHS1_POSN                        equ 0001h
AT1PHSL_PHS1_POSITION                    equ 0001h
AT1PHSL_PHS1_SIZE                        equ 0001h
AT1PHSL_PHS1_LENGTH                      equ 0001h
AT1PHSL_PHS1_MASK                        equ 0002h
AT1PHSL_PHS2_POSN                        equ 0002h
AT1PHSL_PHS2_POSITION                    equ 0002h
AT1PHSL_PHS2_SIZE                        equ 0001h
AT1PHSL_PHS2_LENGTH                      equ 0001h
AT1PHSL_PHS2_MASK                        equ 0004h
AT1PHSL_PHS3_POSN                        equ 0003h
AT1PHSL_PHS3_POSITION                    equ 0003h
AT1PHSL_PHS3_SIZE                        equ 0001h
AT1PHSL_PHS3_LENGTH                      equ 0001h
AT1PHSL_PHS3_MASK                        equ 0008h
AT1PHSL_PHS4_POSN                        equ 0004h
AT1PHSL_PHS4_POSITION                    equ 0004h
AT1PHSL_PHS4_SIZE                        equ 0001h
AT1PHSL_PHS4_LENGTH                      equ 0001h
AT1PHSL_PHS4_MASK                        equ 0010h
AT1PHSL_PHS5_POSN                        equ 0005h
AT1PHSL_PHS5_POSITION                    equ 0005h
AT1PHSL_PHS5_SIZE                        equ 0001h
AT1PHSL_PHS5_LENGTH                      equ 0001h
AT1PHSL_PHS5_MASK                        equ 0020h
AT1PHSL_PHS6_POSN                        equ 0006h
AT1PHSL_PHS6_POSITION                    equ 0006h
AT1PHSL_PHS6_SIZE                        equ 0001h
AT1PHSL_PHS6_LENGTH                      equ 0001h
AT1PHSL_PHS6_MASK                        equ 0040h
AT1PHSL_PHS7_POSN                        equ 0007h
AT1PHSL_PHS7_POSITION                    equ 0007h
AT1PHSL_PHS7_SIZE                        equ 0001h
AT1PHSL_PHS7_LENGTH                      equ 0001h
AT1PHSL_PHS7_MASK                        equ 0080h

// Register: AT1PHSH
#define AT1PHSH AT1PHSH
AT1PHSH                                  equ 0813h
// bitfield definitions
AT1PHSH_AT1PHS8_POSN                     equ 0000h
AT1PHSH_AT1PHS8_POSITION                 equ 0000h
AT1PHSH_AT1PHS8_SIZE                     equ 0001h
AT1PHSH_AT1PHS8_LENGTH                   equ 0001h
AT1PHSH_AT1PHS8_MASK                     equ 0001h
AT1PHSH_AT1PHS9_POSN                     equ 0001h
AT1PHSH_AT1PHS9_POSITION                 equ 0001h
AT1PHSH_AT1PHS9_SIZE                     equ 0001h
AT1PHSH_AT1PHS9_LENGTH                   equ 0001h
AT1PHSH_AT1PHS9_MASK                     equ 0002h
AT1PHSH_PHS8_POSN                        equ 0000h
AT1PHSH_PHS8_POSITION                    equ 0000h
AT1PHSH_PHS8_SIZE                        equ 0001h
AT1PHSH_PHS8_LENGTH                      equ 0001h
AT1PHSH_PHS8_MASK                        equ 0001h
AT1PHSH_PHS9_POSN                        equ 0001h
AT1PHSH_PHS9_POSITION                    equ 0001h
AT1PHSH_PHS9_SIZE                        equ 0001h
AT1PHSH_PHS9_LENGTH                      equ 0001h
AT1PHSH_PHS9_MASK                        equ 0002h
AT1PHSH_PHSL8_POSN                       equ 0000h
AT1PHSH_PHSL8_POSITION                   equ 0000h
AT1PHSH_PHSL8_SIZE                       equ 0001h
AT1PHSH_PHSL8_LENGTH                     equ 0001h
AT1PHSH_PHSL8_MASK                       equ 0001h
AT1PHSH_PHSL9_POSN                       equ 0001h
AT1PHSH_PHSL9_POSITION                   equ 0001h
AT1PHSH_PHSL9_SIZE                       equ 0001h
AT1PHSH_PHSL9_LENGTH                     equ 0001h
AT1PHSH_PHSL9_MASK                       equ 0002h

