GopalSaraf/Practicals/PSDL/include/proc/pic16lf1619.inc
// Register: AT1SIG
#define AT1SIG AT1SIG
AT1SIG                                   equ 088Dh
// bitfield definitions
AT1SIG_SSEL_POSN                         equ 0000h
AT1SIG_SSEL_POSITION                     equ 0000h
AT1SIG_SSEL_SIZE                         equ 0003h
AT1SIG_SSEL_LENGTH                       equ 0003h
AT1SIG_SSEL_MASK                         equ 0007h
AT1SIG_AT1SSEL0_POSN                     equ 0000h
AT1SIG_AT1SSEL0_POSITION                 equ 0000h
AT1SIG_AT1SSEL0_SIZE                     equ 0001h
AT1SIG_AT1SSEL0_LENGTH                   equ 0001h
AT1SIG_AT1SSEL0_MASK                     equ 0001h
AT1SIG_AT1SSEL1_POSN                     equ 0001h
AT1SIG_AT1SSEL1_POSITION                 equ 0001h
AT1SIG_AT1SSEL1_SIZE                     equ 0001h
AT1SIG_AT1SSEL1_LENGTH                   equ 0001h
AT1SIG_AT1SSEL1_MASK                     equ 0002h
AT1SIG_AT1SSEL2_POSN                     equ 0002h
AT1SIG_AT1SSEL2_POSITION                 equ 0002h
AT1SIG_AT1SSEL2_SIZE                     equ 0001h
AT1SIG_AT1SSEL2_LENGTH                   equ 0001h
AT1SIG_AT1SSEL2_MASK                     equ 0004h
AT1SIG_SSEL0_POSN                        equ 0000h
AT1SIG_SSEL0_POSITION                    equ 0000h
AT1SIG_SSEL0_SIZE                        equ 0001h
AT1SIG_SSEL0_LENGTH                      equ 0001h
AT1SIG_SSEL0_MASK                        equ 0001h
AT1SIG_SSEL1_POSN                        equ 0001h
AT1SIG_SSEL1_POSITION                    equ 0001h
AT1SIG_SSEL1_SIZE                        equ 0001h
AT1SIG_SSEL1_LENGTH                      equ 0001h
AT1SIG_SSEL1_MASK                        equ 0002h
AT1SIG_SSEL2_POSN                        equ 0002h
AT1SIG_SSEL2_POSITION                    equ 0002h
AT1SIG_SSEL2_SIZE                        equ 0001h
AT1SIG_SSEL2_LENGTH                      equ 0001h
AT1SIG_SSEL2_MASK                        equ 0004h
AT1SIG_AT1SSEL_POSN                      equ 0000h
AT1SIG_AT1SSEL_POSITION                  equ 0000h
AT1SIG_AT1SSEL_SIZE                      equ 0003h
AT1SIG_AT1SSEL_LENGTH                    equ 0003h
AT1SIG_AT1SSEL_MASK                      equ 0007h

// Register: AT1CSEL1
#define AT1CSEL1 AT1CSEL1
AT1CSEL1                                 equ 088Eh
// bitfield definitions
AT1CSEL1_CP1S_POSN                       equ 0000h
AT1CSEL1_CP1S_POSITION                   equ 0000h
AT1CSEL1_CP1S_SIZE                       equ 0003h
AT1CSEL1_CP1S_LENGTH                     equ 0003h
AT1CSEL1_CP1S_MASK                       equ 0007h
AT1CSEL1_AT1CP1S0_POSN                   equ 0000h
AT1CSEL1_AT1CP1S0_POSITION               equ 0000h
AT1CSEL1_AT1CP1S0_SIZE                   equ 0001h
AT1CSEL1_AT1CP1S0_LENGTH                 equ 0001h
AT1CSEL1_AT1CP1S0_MASK                   equ 0001h
AT1CSEL1_AT1CP1S1_POSN                   equ 0001h
AT1CSEL1_AT1CP1S1_POSITION               equ 0001h
AT1CSEL1_AT1CP1S1_SIZE                   equ 0001h
AT1CSEL1_AT1CP1S1_LENGTH                 equ 0001h
AT1CSEL1_AT1CP1S1_MASK                   equ 0002h
AT1CSEL1_AT1CP1S2_POSN                   equ 0002h
AT1CSEL1_AT1CP1S2_POSITION               equ 0002h
AT1CSEL1_AT1CP1S2_SIZE                   equ 0001h
AT1CSEL1_AT1CP1S2_LENGTH                 equ 0001h
AT1CSEL1_AT1CP1S2_MASK                   equ 0004h
AT1CSEL1_CP1S0_POSN                      equ 0000h
AT1CSEL1_CP1S0_POSITION                  equ 0000h
AT1CSEL1_CP1S0_SIZE                      equ 0001h
AT1CSEL1_CP1S0_LENGTH                    equ 0001h
AT1CSEL1_CP1S0_MASK                      equ 0001h
AT1CSEL1_CP1S1_POSN                      equ 0001h
AT1CSEL1_CP1S1_POSITION                  equ 0001h
AT1CSEL1_CP1S1_SIZE                      equ 0001h
AT1CSEL1_CP1S1_LENGTH                    equ 0001h
AT1CSEL1_CP1S1_MASK                      equ 0002h
AT1CSEL1_CP1S2_POSN                      equ 0002h
AT1CSEL1_CP1S2_POSITION                  equ 0002h
AT1CSEL1_CP1S2_SIZE                      equ 0001h
AT1CSEL1_CP1S2_LENGTH                    equ 0001h
AT1CSEL1_CP1S2_MASK                      equ 0004h
AT1CSEL1_AT1CP1S_POSN                    equ 0000h
AT1CSEL1_AT1CP1S_POSITION                equ 0000h
AT1CSEL1_AT1CP1S_SIZE                    equ 0003h
AT1CSEL1_AT1CP1S_LENGTH                  equ 0003h
AT1CSEL1_AT1CP1S_MASK                    equ 0007h

// Register: AT1CC1L
#define AT1CC1L AT1CC1L
AT1CC1L                                  equ 088Fh
// bitfield definitions
AT1CC1L_AT1CC10_POSN                     equ 0000h
AT1CC1L_AT1CC10_POSITION                 equ 0000h
AT1CC1L_AT1CC10_SIZE                     equ 0001h
AT1CC1L_AT1CC10_LENGTH                   equ 0001h
AT1CC1L_AT1CC10_MASK                     equ 0001h
AT1CC1L_AT1CC11_POSN                     equ 0001h
AT1CC1L_AT1CC11_POSITION                 equ 0001h
AT1CC1L_AT1CC11_SIZE                     equ 0001h
AT1CC1L_AT1CC11_LENGTH                   equ 0001h
AT1CC1L_AT1CC11_MASK                     equ 0002h
AT1CC1L_AT1CC12_POSN                     equ 0002h
AT1CC1L_AT1CC12_POSITION                 equ 0002h
AT1CC1L_AT1CC12_SIZE                     equ 0001h
AT1CC1L_AT1CC12_LENGTH                   equ 0001h
AT1CC1L_AT1CC12_MASK                     equ 0004h
AT1CC1L_AT1CC13_POSN                     equ 0003h
AT1CC1L_AT1CC13_POSITION                 equ 0003h
AT1CC1L_AT1CC13_SIZE                     equ 0001h
AT1CC1L_AT1CC13_LENGTH                   equ 0001h
AT1CC1L_AT1CC13_MASK                     equ 0008h
AT1CC1L_AT1CC14_POSN                     equ 0004h
AT1CC1L_AT1CC14_POSITION                 equ 0004h
AT1CC1L_AT1CC14_SIZE                     equ 0001h
AT1CC1L_AT1CC14_LENGTH                   equ 0001h
AT1CC1L_AT1CC14_MASK                     equ 0010h
AT1CC1L_AT1CC15_POSN                     equ 0005h
AT1CC1L_AT1CC15_POSITION                 equ 0005h
AT1CC1L_AT1CC15_SIZE                     equ 0001h
AT1CC1L_AT1CC15_LENGTH                   equ 0001h
AT1CC1L_AT1CC15_MASK                     equ 0020h
AT1CC1L_AT1CC16_POSN                     equ 0006h
AT1CC1L_AT1CC16_POSITION                 equ 0006h
AT1CC1L_AT1CC16_SIZE                     equ 0001h
AT1CC1L_AT1CC16_LENGTH                   equ 0001h
AT1CC1L_AT1CC16_MASK                     equ 0040h
AT1CC1L_AT1CC17_POSN                     equ 0007h
AT1CC1L_AT1CC17_POSITION                 equ 0007h
AT1CC1L_AT1CC17_SIZE                     equ 0001h
AT1CC1L_AT1CC17_LENGTH                   equ 0001h
AT1CC1L_AT1CC17_MASK                     equ 0080h
AT1CC1L_CC10_POSN                        equ 0000h
AT1CC1L_CC10_POSITION                    equ 0000h
AT1CC1L_CC10_SIZE                        equ 0001h
AT1CC1L_CC10_LENGTH                      equ 0001h
AT1CC1L_CC10_MASK                        equ 0001h
AT1CC1L_CC11_POSN                        equ 0001h
AT1CC1L_CC11_POSITION                    equ 0001h
AT1CC1L_CC11_SIZE                        equ 0001h
AT1CC1L_CC11_LENGTH                      equ 0001h
AT1CC1L_CC11_MASK                        equ 0002h
AT1CC1L_CC12_POSN                        equ 0002h
AT1CC1L_CC12_POSITION                    equ 0002h
AT1CC1L_CC12_SIZE                        equ 0001h
AT1CC1L_CC12_LENGTH                      equ 0001h
AT1CC1L_CC12_MASK                        equ 0004h
AT1CC1L_CC13_POSN                        equ 0003h
AT1CC1L_CC13_POSITION                    equ 0003h
AT1CC1L_CC13_SIZE                        equ 0001h
AT1CC1L_CC13_LENGTH                      equ 0001h
AT1CC1L_CC13_MASK                        equ 0008h
AT1CC1L_CC14_POSN                        equ 0004h
AT1CC1L_CC14_POSITION                    equ 0004h
AT1CC1L_CC14_SIZE                        equ 0001h
AT1CC1L_CC14_LENGTH                      equ 0001h
AT1CC1L_CC14_MASK                        equ 0010h
AT1CC1L_CC15_POSN                        equ 0005h
AT1CC1L_CC15_POSITION                    equ 0005h
AT1CC1L_CC15_SIZE                        equ 0001h
AT1CC1L_CC15_LENGTH                      equ 0001h
AT1CC1L_CC15_MASK                        equ 0020h
AT1CC1L_CC16_POSN                        equ 0006h
AT1CC1L_CC16_POSITION                    equ 0006h
AT1CC1L_CC16_SIZE                        equ 0001h
AT1CC1L_CC16_LENGTH                      equ 0001h
AT1CC1L_CC16_MASK                        equ 0040h
AT1CC1L_CC17_POSN                        equ 0007h
AT1CC1L_CC17_POSITION                    equ 0007h
AT1CC1L_CC17_SIZE                        equ 0001h
AT1CC1L_CC17_LENGTH                      equ 0001h
AT1CC1L_CC17_MASK                        equ 0080h

// Register: AT1CC1H
#define AT1CC1H AT1CC1H
AT1CC1H                                  equ 0890h
// bitfield definitions
AT1CC1H_AT1CC18_POSN                     equ 0000h
AT1CC1H_AT1CC18_POSITION                 equ 0000h
AT1CC1H_AT1CC18_SIZE                     equ 0001h
AT1CC1H_AT1CC18_LENGTH                   equ 0001h
AT1CC1H_AT1CC18_MASK                     equ 0001h
AT1CC1H_AT1CC19_POSN                     equ 0001h
AT1CC1H_AT1CC19_POSITION                 equ 0001h
AT1CC1H_AT1CC19_SIZE                     equ 0001h
AT1CC1H_AT1CC19_LENGTH                   equ 0001h
AT1CC1H_AT1CC19_MASK                     equ 0002h
AT1CC1H_CC18_POSN                        equ 0000h
AT1CC1H_CC18_POSITION                    equ 0000h
AT1CC1H_CC18_SIZE                        equ 0001h
AT1CC1H_CC18_LENGTH                      equ 0001h
AT1CC1H_CC18_MASK                        equ 0001h
AT1CC1H_CC19_POSN                        equ 0001h
AT1CC1H_CC19_POSITION                    equ 0001h
AT1CC1H_CC19_SIZE                        equ 0001h
AT1CC1H_CC19_LENGTH                      equ 0001h
AT1CC1H_CC19_MASK                        equ 0002h

// Register: AT1CCON1
#define AT1CCON1 AT1CCON1
AT1CCON1                                 equ 0891h
// bitfield definitions
AT1CCON1_AT1CC1MODE_POSN                 equ 0000h
AT1CCON1_AT1CC1MODE_POSITION             equ 0000h
AT1CCON1_AT1CC1MODE_SIZE                 equ 0001h
AT1CCON1_AT1CC1MODE_LENGTH               equ 0001h
AT1CCON1_AT1CC1MODE_MASK                 equ 0001h
AT1CCON1_AT1CAP1P_POSN                   equ 0003h
AT1CCON1_AT1CAP1P_POSITION               equ 0003h
AT1CCON1_AT1CAP1P_SIZE                   equ 0001h
AT1CCON1_AT1CAP1P_LENGTH                 equ 0001h
AT1CCON1_AT1CAP1P_MASK                   equ 0008h
AT1CCON1_AT1CC1POL_POSN                  equ 0004h
AT1CCON1_AT1CC1POL_POSITION              equ 0004h
AT1CCON1_AT1CC1POL_SIZE                  equ 0001h
AT1CCON1_AT1CC1POL_LENGTH                equ 0001h
AT1CCON1_AT1CC1POL_MASK                  equ 0010h
AT1CCON1_AT1CC1EN_POSN                   equ 0007h
AT1CCON1_AT1CC1EN_POSITION               equ 0007h
AT1CCON1_AT1CC1EN_SIZE                   equ 0001h
AT1CCON1_AT1CC1EN_LENGTH                 equ 0001h
AT1CCON1_AT1CC1EN_MASK                   equ 0080h
AT1CCON1_CC1MODE_POSN                    equ 0000h
AT1CCON1_CC1MODE_POSITION                equ 0000h
AT1CCON1_CC1MODE_SIZE                    equ 0001h
AT1CCON1_CC1MODE_LENGTH                  equ 0001h
AT1CCON1_CC1MODE_MASK                    equ 0001h
AT1CCON1_CAP1P_POSN                      equ 0003h
AT1CCON1_CAP1P_POSITION                  equ 0003h
AT1CCON1_CAP1P_SIZE                      equ 0001h
AT1CCON1_CAP1P_LENGTH                    equ 0001h
AT1CCON1_CAP1P_MASK                      equ 0008h
AT1CCON1_CC1POL_POSN                     equ 0004h
AT1CCON1_CC1POL_POSITION                 equ 0004h
AT1CCON1_CC1POL_SIZE                     equ 0001h
AT1CCON1_CC1POL_LENGTH                   equ 0001h
AT1CCON1_CC1POL_MASK                     equ 0010h
AT1CCON1_CC1EN_POSN                      equ 0007h
AT1CCON1_CC1EN_POSITION                  equ 0007h
AT1CCON1_CC1EN_SIZE                      equ 0001h
AT1CCON1_CC1EN_LENGTH                    equ 0001h
AT1CCON1_CC1EN_MASK                      equ 0080h

