GopalSaraf/Practicals/PSDL/include/proc/pic16lf1619.inc
// Register: T4PPS
#define T4PPS T4PPS
T4PPS                                    equ 0E1Bh
// bitfield definitions
T4PPS_T4PPS0_POSN                        equ 0000h
T4PPS_T4PPS0_POSITION                    equ 0000h
T4PPS_T4PPS0_SIZE                        equ 0001h
T4PPS_T4PPS0_LENGTH                      equ 0001h
T4PPS_T4PPS0_MASK                        equ 0001h
T4PPS_T4PPS1_POSN                        equ 0001h
T4PPS_T4PPS1_POSITION                    equ 0001h
T4PPS_T4PPS1_SIZE                        equ 0001h
T4PPS_T4PPS1_LENGTH                      equ 0001h
T4PPS_T4PPS1_MASK                        equ 0002h
T4PPS_T4PPS2_POSN                        equ 0002h
T4PPS_T4PPS2_POSITION                    equ 0002h
T4PPS_T4PPS2_SIZE                        equ 0001h
T4PPS_T4PPS2_LENGTH                      equ 0001h
T4PPS_T4PPS2_MASK                        equ 0004h
T4PPS_T4PPS3_POSN                        equ 0003h
T4PPS_T4PPS3_POSITION                    equ 0003h
T4PPS_T4PPS3_SIZE                        equ 0001h
T4PPS_T4PPS3_LENGTH                      equ 0001h
T4PPS_T4PPS3_MASK                        equ 0008h
T4PPS_T4PPS4_POSN                        equ 0004h
T4PPS_T4PPS4_POSITION                    equ 0004h
T4PPS_T4PPS4_SIZE                        equ 0001h
T4PPS_T4PPS4_LENGTH                      equ 0001h
T4PPS_T4PPS4_MASK                        equ 0010h

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
T5CKIPPS                                 equ 0E1Ch
// bitfield definitions
T5CKIPPS_T5CKIPPS0_POSN                  equ 0000h
T5CKIPPS_T5CKIPPS0_POSITION              equ 0000h
T5CKIPPS_T5CKIPPS0_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS0_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS0_MASK                  equ 0001h
T5CKIPPS_T5CKIPPS1_POSN                  equ 0001h
T5CKIPPS_T5CKIPPS1_POSITION              equ 0001h
T5CKIPPS_T5CKIPPS1_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS1_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS1_MASK                  equ 0002h
T5CKIPPS_T5CKIPPS2_POSN                  equ 0002h
T5CKIPPS_T5CKIPPS2_POSITION              equ 0002h
T5CKIPPS_T5CKIPPS2_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS2_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS2_MASK                  equ 0004h
T5CKIPPS_T5CKIPPS3_POSN                  equ 0003h
T5CKIPPS_T5CKIPPS3_POSITION              equ 0003h
T5CKIPPS_T5CKIPPS3_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS3_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS3_MASK                  equ 0008h
T5CKIPPS_T5CKIPPS4_POSN                  equ 0004h
T5CKIPPS_T5CKIPPS4_POSITION              equ 0004h
T5CKIPPS_T5CKIPPS4_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS4_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS4_MASK                  equ 0010h

// Register: T5GPPS
#define T5GPPS T5GPPS
T5GPPS                                   equ 0E1Dh
// bitfield definitions
T5GPPS_T5GPPS0_POSN                      equ 0000h
T5GPPS_T5GPPS0_POSITION                  equ 0000h
T5GPPS_T5GPPS0_SIZE                      equ 0001h
T5GPPS_T5GPPS0_LENGTH                    equ 0001h
T5GPPS_T5GPPS0_MASK                      equ 0001h
T5GPPS_T5GPPS1_POSN                      equ 0001h
T5GPPS_T5GPPS1_POSITION                  equ 0001h
T5GPPS_T5GPPS1_SIZE                      equ 0001h
T5GPPS_T5GPPS1_LENGTH                    equ 0001h
T5GPPS_T5GPPS1_MASK                      equ 0002h
T5GPPS_T5GPPS2_POSN                      equ 0002h
T5GPPS_T5GPPS2_POSITION                  equ 0002h
T5GPPS_T5GPPS2_SIZE                      equ 0001h
T5GPPS_T5GPPS2_LENGTH                    equ 0001h
T5GPPS_T5GPPS2_MASK                      equ 0004h
T5GPPS_T5GPPS3_POSN                      equ 0003h
T5GPPS_T5GPPS3_POSITION                  equ 0003h
T5GPPS_T5GPPS3_SIZE                      equ 0001h
T5GPPS_T5GPPS3_LENGTH                    equ 0001h
T5GPPS_T5GPPS3_MASK                      equ 0008h
T5GPPS_T5GPPS4_POSN                      equ 0004h
T5GPPS_T5GPPS4_POSITION                  equ 0004h
T5GPPS_T5GPPS4_SIZE                      equ 0001h
T5GPPS_T5GPPS4_LENGTH                    equ 0001h
T5GPPS_T5GPPS4_MASK                      equ 0010h

// Register: T6PPS
#define T6PPS T6PPS
T6PPS                                    equ 0E1Eh
// bitfield definitions
T6PPS_T6PPS0_POSN                        equ 0000h
T6PPS_T6PPS0_POSITION                    equ 0000h
T6PPS_T6PPS0_SIZE                        equ 0001h
T6PPS_T6PPS0_LENGTH                      equ 0001h
T6PPS_T6PPS0_MASK                        equ 0001h
T6PPS_T6PPS1_POSN                        equ 0001h
T6PPS_T6PPS1_POSITION                    equ 0001h
T6PPS_T6PPS1_SIZE                        equ 0001h
T6PPS_T6PPS1_LENGTH                      equ 0001h
T6PPS_T6PPS1_MASK                        equ 0002h
T6PPS_T6PPS2_POSN                        equ 0002h
T6PPS_T6PPS2_POSITION                    equ 0002h
T6PPS_T6PPS2_SIZE                        equ 0001h
T6PPS_T6PPS2_LENGTH                      equ 0001h
T6PPS_T6PPS2_MASK                        equ 0004h
T6PPS_T6PPS3_POSN                        equ 0003h
T6PPS_T6PPS3_POSITION                    equ 0003h
T6PPS_T6PPS3_SIZE                        equ 0001h
T6PPS_T6PPS3_LENGTH                      equ 0001h
T6PPS_T6PPS3_MASK                        equ 0008h
T6PPS_T6PPS4_POSN                        equ 0004h
T6PPS_T6PPS4_POSITION                    equ 0004h
T6PPS_T6PPS4_SIZE                        equ 0001h
T6PPS_T6PPS4_LENGTH                      equ 0001h
T6PPS_T6PPS4_MASK                        equ 0010h

// Register: ATCC1PPS
#define ATCC1PPS ATCC1PPS
ATCC1PPS                                 equ 0E1Fh
// bitfield definitions
ATCC1PPS_ATCC1PPS0_POSN                  equ 0000h
ATCC1PPS_ATCC1PPS0_POSITION              equ 0000h
ATCC1PPS_ATCC1PPS0_SIZE                  equ 0001h
ATCC1PPS_ATCC1PPS0_LENGTH                equ 0001h
ATCC1PPS_ATCC1PPS0_MASK                  equ 0001h
ATCC1PPS_ATCC1PPS1_POSN                  equ 0001h
ATCC1PPS_ATCC1PPS1_POSITION              equ 0001h
ATCC1PPS_ATCC1PPS1_SIZE                  equ 0001h
ATCC1PPS_ATCC1PPS1_LENGTH                equ 0001h
ATCC1PPS_ATCC1PPS1_MASK                  equ 0002h
ATCC1PPS_ATCC1PPS2_POSN                  equ 0002h
ATCC1PPS_ATCC1PPS2_POSITION              equ 0002h
ATCC1PPS_ATCC1PPS2_SIZE                  equ 0001h
ATCC1PPS_ATCC1PPS2_LENGTH                equ 0001h
ATCC1PPS_ATCC1PPS2_MASK                  equ 0004h
ATCC1PPS_ATCC1PPS3_POSN                  equ 0003h
ATCC1PPS_ATCC1PPS3_POSITION              equ 0003h
ATCC1PPS_ATCC1PPS3_SIZE                  equ 0001h
ATCC1PPS_ATCC1PPS3_LENGTH                equ 0001h
ATCC1PPS_ATCC1PPS3_MASK                  equ 0008h
ATCC1PPS_ATCC1PPS4_POSN                  equ 0004h
ATCC1PPS_ATCC1PPS4_POSITION              equ 0004h
ATCC1PPS_ATCC1PPS4_SIZE                  equ 0001h
ATCC1PPS_ATCC1PPS4_LENGTH                equ 0001h
ATCC1PPS_ATCC1PPS4_MASK                  equ 0010h

// Register: SSPCLKPPS
#define SSPCLKPPS SSPCLKPPS
SSPCLKPPS                                equ 0E20h
// bitfield definitions
SSPCLKPPS_SSPCLKPPS0_POSN                equ 0000h
SSPCLKPPS_SSPCLKPPS0_POSITION            equ 0000h
SSPCLKPPS_SSPCLKPPS0_SIZE                equ 0001h
SSPCLKPPS_SSPCLKPPS0_LENGTH              equ 0001h
SSPCLKPPS_SSPCLKPPS0_MASK                equ 0001h
SSPCLKPPS_SSPCLKPPS1_POSN                equ 0001h
SSPCLKPPS_SSPCLKPPS1_POSITION            equ 0001h
SSPCLKPPS_SSPCLKPPS1_SIZE                equ 0001h
SSPCLKPPS_SSPCLKPPS1_LENGTH              equ 0001h
SSPCLKPPS_SSPCLKPPS1_MASK                equ 0002h
SSPCLKPPS_SSPCLKPPS2_POSN                equ 0002h
SSPCLKPPS_SSPCLKPPS2_POSITION            equ 0002h
SSPCLKPPS_SSPCLKPPS2_SIZE                equ 0001h
SSPCLKPPS_SSPCLKPPS2_LENGTH              equ 0001h
SSPCLKPPS_SSPCLKPPS2_MASK                equ 0004h
SSPCLKPPS_SSPCLKPPS3_POSN                equ 0003h
SSPCLKPPS_SSPCLKPPS3_POSITION            equ 0003h
SSPCLKPPS_SSPCLKPPS3_SIZE                equ 0001h
SSPCLKPPS_SSPCLKPPS3_LENGTH              equ 0001h
SSPCLKPPS_SSPCLKPPS3_MASK                equ 0008h
SSPCLKPPS_SSPCLKPPS4_POSN                equ 0004h
SSPCLKPPS_SSPCLKPPS4_POSITION            equ 0004h
SSPCLKPPS_SSPCLKPPS4_SIZE                equ 0001h
SSPCLKPPS_SSPCLKPPS4_LENGTH              equ 0001h
SSPCLKPPS_SSPCLKPPS4_MASK                equ 0010h

// Register: SSPDATPPS
#define SSPDATPPS SSPDATPPS
SSPDATPPS                                equ 0E21h
// bitfield definitions
SSPDATPPS_SSPDATPPS0_POSN                equ 0000h
SSPDATPPS_SSPDATPPS0_POSITION            equ 0000h
SSPDATPPS_SSPDATPPS0_SIZE                equ 0001h
SSPDATPPS_SSPDATPPS0_LENGTH              equ 0001h
SSPDATPPS_SSPDATPPS0_MASK                equ 0001h
SSPDATPPS_SSPDATPPS1_POSN                equ 0001h
SSPDATPPS_SSPDATPPS1_POSITION            equ 0001h
SSPDATPPS_SSPDATPPS1_SIZE                equ 0001h
SSPDATPPS_SSPDATPPS1_LENGTH              equ 0001h
SSPDATPPS_SSPDATPPS1_MASK                equ 0002h
SSPDATPPS_SSPDATPPS2_POSN                equ 0002h
SSPDATPPS_SSPDATPPS2_POSITION            equ 0002h
SSPDATPPS_SSPDATPPS2_SIZE                equ 0001h
SSPDATPPS_SSPDATPPS2_LENGTH              equ 0001h
SSPDATPPS_SSPDATPPS2_MASK                equ 0004h
SSPDATPPS_SSPDATPPS3_POSN                equ 0003h
SSPDATPPS_SSPDATPPS3_POSITION            equ 0003h
SSPDATPPS_SSPDATPPS3_SIZE                equ 0001h
SSPDATPPS_SSPDATPPS3_LENGTH              equ 0001h
SSPDATPPS_SSPDATPPS3_MASK                equ 0008h
SSPDATPPS_SSPDATPPS4_POSN                equ 0004h
SSPDATPPS_SSPDATPPS4_POSITION            equ 0004h
SSPDATPPS_SSPDATPPS4_SIZE                equ 0001h
SSPDATPPS_SSPDATPPS4_LENGTH              equ 0001h
SSPDATPPS_SSPDATPPS4_MASK                equ 0010h

// Register: SSPSSPPS
#define SSPSSPPS SSPSSPPS
SSPSSPPS                                 equ 0E22h
// bitfield definitions
SSPSSPPS_SSPSSPPS0_POSN                  equ 0000h
SSPSSPPS_SSPSSPPS0_POSITION              equ 0000h
SSPSSPPS_SSPSSPPS0_SIZE                  equ 0001h
SSPSSPPS_SSPSSPPS0_LENGTH                equ 0001h
SSPSSPPS_SSPSSPPS0_MASK                  equ 0001h
SSPSSPPS_SSPSSPPS1_POSN                  equ 0001h
SSPSSPPS_SSPSSPPS1_POSITION              equ 0001h
SSPSSPPS_SSPSSPPS1_SIZE                  equ 0001h
SSPSSPPS_SSPSSPPS1_LENGTH                equ 0001h
SSPSSPPS_SSPSSPPS1_MASK                  equ 0002h
SSPSSPPS_SSPSSPPS2_POSN                  equ 0002h
SSPSSPPS_SSPSSPPS2_POSITION              equ 0002h
SSPSSPPS_SSPSSPPS2_SIZE                  equ 0001h
SSPSSPPS_SSPSSPPS2_LENGTH                equ 0001h
SSPSSPPS_SSPSSPPS2_MASK                  equ 0004h
SSPSSPPS_SSPSSPPS3_POSN                  equ 0003h
SSPSSPPS_SSPSSPPS3_POSITION              equ 0003h
SSPSSPPS_SSPSSPPS3_SIZE                  equ 0001h
SSPSSPPS_SSPSSPPS3_LENGTH                equ 0001h
SSPSSPPS_SSPSSPPS3_MASK                  equ 0008h
SSPSSPPS_SSPSSPPS4_POSN                  equ 0004h
SSPSSPPS_SSPSSPPS4_POSITION              equ 0004h
SSPSSPPS_SSPSSPPS4_SIZE                  equ 0001h
SSPSSPPS_SSPSSPPS4_LENGTH                equ 0001h
SSPSSPPS_SSPSSPPS4_MASK                  equ 0010h

